{"text": "My own fault to some degree, ordering fish at a steak house. An attractive fish item was on the specials menu, and three of the four of us ordered it. All were bland, dry, and completely devoid of taste except for a rather strange, off-putting, nearly disgusting use of anise as a spice that overwhelmed all else. The one of our party who ordered steak reported it was quite good.", "label": "business"}
{"text": "Made reservation and had the host repeat them back to me. Arrived and was told there was no reservation. They then seated us next to the kitchen door and wait station. There was a booth available but not seated there. Pork was overdone when asked for med rare. Appetizer was fairly good. Bread was chewy. Watched as our waiter took care of every need at a table next to us. House servers brought our food out almost as an after thought. Sorry it was my husband's first trip to NorthEnd. I know there is better food and better service for less money.", "label": "romantic"}
{"text": "We enjoyed the appetizers and entree was perfect The atmosphere at restaurant is perfect, plenty of room and very relaxing", "label": "romantic"}
{"text": "I have had the privilege of traveling and eating at wonderful places abroad. I must say my experience at Capital Grille was beyond outstanding. The food was phenomenal but what really stood out was our server Molly. She had the expertise of not only being subtly on top of everything,but the perfect balance of being friendly and attentive. We came to celebrate a birthday and were treated so well that I must go back. Great food served with smiles is a must. I highly recommend this restaurant.", "label": "romantic"}
{"text": "Both service and food were impressive. Ambiance was very \"today\"! Perfect for business and also special treat.", "label": "business"}
{"text": "We had a nice time at Q restaurant both for lunch and dinner. The environment was quieter for lunch and busier in the evening, but still not disturbing. The atmosphere was cordially accommodating and informal. There was a vast choice of different Asian kitchens. We had Chinese specialties, mainly of chicken in different styles and liked them all. Service was fast and attentive. Great value for money.", "label": "family"}
{"text": "The food was great as was the atmosphere and service. A family run restaurant near Little Italy is worth the two-block walk from the beaten track. Be sure to get a reservation of to show up early, because it gets crowded. BTW, the arancini’s are to die for.", "label": "romantic"}
{"text": "Visiting my daughter for the weekend in Boston. So much for choice when it comes to food. We decided on burgers, boring, oh well. Boston Burgers has the best burgers, no regrets. The menu is so extensive. I had the \"Kitchen Sink\", so good. Order one and you'll know why it's called the Kitchen Sink! I ordered the burger medium rare, and it was cooked to perfection.", "label": "family"}
{"text": "Great food, beef and black bean sauce a highlight for us. Good drinks (Blue Moon on tap but cocktails also) and barman was very good. Well worth a visit.", "label": "family"}
{"text": "Our rating is low due to the extremely high prices for everything including bread and water! Yes that’s right, there is no free water. We had two appetizers, two entrees, three glasses of wine, bread, and two bottles of water…..total, with tip, $325+! The food was tasty and plentiful. The service was fine not overly intrusive. We sat at a high table, which was great. There were a total of four high tables in the bar area and the noise and people were minimal. I doubt we will return due to the extremely high prices for everything. In looking back we should have ordered one entree to share with each of us getting an appetizer, skip the water and bread, and one glass of wine. Then the bill would have only around $200….", "label": "romantic"}
{"text": "We have been to this place before and the food is always amazing which was the case again this time. The absolute best gnocchi I have had in a very long time. We were seated in back room which was very nice...quiet and away from bustle of main dining room. The service started off good until a large party was seated next to us and then we didn't see our server after that which was too bad because we probably would have stayed a bit longer and had another drink and possibly dessert. Another server came over with the desert cart but I was too annoyed at that point to stay any longer...then we waited forever to get the check...all the while we watched our server a couple feet from us taking care of the other table...not once turning his attention to us..i honestly felt forgotten about and considering the amount of time we waited to get the check it was a valid feeling. When your paying prices on the higher end of the scale you expect a certain level of service and that was not delivered this time. I was very disappointed but I will still go back again as it's truly one of the better places to eat in Boston.", "label": "romantic"}
{"text": "We booked a reservation for four after visiting our son for his internship for college. The Q i noticed was a good choice on Tripadvisor‘s. It did not disappoint us at all, Johnny was a great server, helped us with our Mongolian hot pots that we ordered. We ordered the Supreme seafood and also the Supreme beef both of which were outstanding! I will go back here again!", "label": "family"}
{"text": "We made reservations for this pricey establishment knowing that it got great reviews. After a cheerful waiter took our 3 course order and brought drinks, the food came in rapid succession without a breather between courses. The staff looked like they were practically running from table to table. Food was good (not great) as were the drinks and wine. When we expressed an interest in the after dinner drink menu and coffee, our waiter was a bit taken aback! Nevertheless, we paid our bill and left after just an hour! Not your traditional, relaxing Italian meal. If the purpose of restaurant week is to introduce new diners so that they return, it didn't work for us! Although,I am sure it deserves it's rating, don't go during restaurant week.", "label": "romantic"}
{"text": "After seeing this Italian restaurant in the top 10 we wanted to try it, but found that is was a little off the beaten track and out of the north end area. However given the other reviews we got Uber to take us the extra 10mins and were greatly impressed. The pasta was sublime. Perfect al dente texture and soooooo fresh. Amazing! We can recommend the lobster ravioli, the bolognese and the meat balls. Authentic Italian that some North End restaurants have forgotten.", "label": "family"}
{"text": "Remains best of boston at the ultra high end. Mistral provides excellent service and food. Their menu has something for everyone. Prices have increased significantly over the last two years. Their are 86 reasons to still have the rack of lamb. The serving size, quality, and preparation remain worth it. The wine list is extensive. The Prisoner Cab at 120 was a reasonable option.", "label": "romantic"}
{"text": "We read tons of reviews before choosing Al Dente for our Easter dinner. We were so happy to have found this restaurant and look forward to another trip in the future. We arrived early for 6 PM reservations and they happily showed us to our table. Our waitress was Marion and she was friendly but not obtrusive. Our bus boy (sorry, did not get his name) was also very personable as he tended to our table. The Ceasar salad for 2 was just fantastic and too much for just us so Marion brought extra plates for the other 3 at our table to share. The salad was just delicious and something I wish I could duplicate at home. Our entrees ranged from 2 different veal dishes to shrimp and scallops with vodka sauce over fresh pasta. My husband had been scraving shrimp Fra Diavolo and found it here - along with calamari added to the plate. The portions were huge and this is when you're sad to be staying in a hotel - no leftovers! An interesting note is Al Dente does not serve coffee or dessert - I'm sure it's a way to turn their tables a little quicker, as this restaurant is quite small. It wasn't a problem as we visited one of the pastry shops in the North End to get dessert and took it back to our hotel. To end our meal we were all served shots of Limoncello - not sure if this was because it was Easter or if they do this all the time. But it was a nice touch. Can't wait to go back!", "label": "family"}
{"text": "Food menu, with combination of fish and meat. Appetizers were good - the grilled octopus and squid came with a lot of tomato sauce and beans. Good, but a bit too rich. I prefer plain grilled squid. But the sauce was good and went well with the bread. The grilled tuna was excellent- this is why I gave 5 stars. Tender, tasty with herbs (and a lot if salt), it went great with the pesto and other ingredients. Dessert was OK. Good wine selection. Good service. Nice location. Barely makes it to 5 stars, but the tuna made the night.", "label": "business"}
{"text": "I dined with my boyfriend at Deuxave on April 15, and had absolutely the worst experience I have ever had at a fine dining establishment. We came there hoping to celebrate our six year anniversary, and received the most atrocious service I've ever encountered. While the food (except the soggy fries) tasted fantastic, the platinum blonde waitress who served us was not only rude but also downright disrespectful the entire time. She completely ruined our anniversary and what was supposed to be a wonderful dining experience. Firstly, she refused to accommodate for any of our requests-- even a simple one such as extra sauce on the side. Secondly, we had to ask other servers to find her because she would disappear and not check back in for at least half an hour at a time. Thirdly, she treated us with the most despicable attitude as if we were beneath her despite the abundance of expensive food and drinks we had ordered. Her horrible service honestly made me lose my appetite. I ended up just packing up 3/4 of the duck I ordered. Lastly, we had to wait over half an hour just to receive our check. It's one thing if she were having a bad day, but to take it out on the customers is just absolutely unprofessional. Furthermore, we called the restaurant the next day to tell them of our horrible dining experience. We spoke to the General Manager who said she would call us back for a solution. It's been over two weeks now and we have yet to receive a call from the General Manager. It seems to me that Deuxave simply does not appreciate their customers and has revealed their low quality service by lying about something as simple as returning a phone call.", "label": "romantic"}
{"text": "Not impressed with the cold host at the door. Don't care how great their food is. Will never go again.", "label": "family"}
{"text": "If you are hungry for meat, this is the place. The 16 oz aged ribeye was amazing, and the sides were just as good. The challenge here was the service. Even with a reservation on a Tuesday night, we still did not have our table until 40 minutes later! We ended up sitting at the bar, and is was tough to get the attention of the bar staff for to order or even get silverware. Exceptional food, but very bad service, especially when paying over $100 a head for dinner.", "label": "business"}
{"text": "What should have been a nice experience at a good restaurant was marred by a bad table. We arrived for our reservation at 6:00 and were shown to a table facing the kitchen. It was still quiet, so we didn’t comment. However, as the restaurant got busier, the traffic in and out of the kitchen increased markedly. We asked a manager why we were given such a bad table so early in the evening, and he was more defensive than apologetic. Many tables continued to be available, so it was not a space issue. He could have assuaged our feelings by offering a drink or a dessert, but he did nothing. Poor public relations. Next time I will be more vocal when shown a bad table, but we will not be returning to this restaurant even though the food was good", "label": "romantic"}
{"text": "The burgers were great and the sewrvice was excellent! I would definitely go back if we are ever in Boston again.", "label": "family"}
{"text": "We had a wonderful work dinner for 40 people at Davio's and the service, environment and food was top notch. The Davio's team was great to work with in planning the event. Food was delicious and, for the price, we had terrific options! We'll definitely go back!", "label": "business"}
{"text": "The portions and service are great. The pasta dishes were tasty but my haddock was just “ok” and slightly cold so hence the 3star rating. Would have given them a 4. Their menu is good and has a lot of pasta choices. If you are looking for a place to get homemade pasta you will like this place. It’s good.", "label": "family"}
{"text": "This place could be so much better with very little effort.The tables on the patio are way too close together. The waiter was so busy with way too many tables to care for. It took 15 minutes for anyone to come to our table. The charcuterie plate was ok. The duck breast was overdone and tasteless. The mussels were awful. Thick lemon rinds and carrots????Note to the chef: Have you tasted your mussels lately??... Just gross...With all the other choices in Boston, I would never go back there. NOT to be compared with any real French places...", "label": "romantic"}
{"text": "This place was hopping for a Monday late afternoon! Enjoyed sitting outside with our sandwiches. They were amazing but I think $100 for 4 sandwiches, a small fry and 2 drinks is excessive.", "label": "family"}
{"text": "This is difficult to rate and write. We were treated very well and reservations were enlarged twice. Very accommodating and professional. The service for a party 8 was excellent thought out the evening The food was very good. so-- why the low rating? It would have been a 5 except look at the receipt. We spit the check two ways. Look at the attached photo and the \"suggested\" tip. each half reflects the TOTAL tip so if you followed their suggestion you would be paying 42% rather than 21%. $270,28 tip $688 check Do they do this on every split check? If you are visiting with friends, had a few drinks or just trusting the numbers you could be grossly overcharged. This may be a computer mistake-If so it needs to be fixed. If it is an honesty issue it is unforgivable... be careful", "label": "business"}
{"text": "Great to have a hot pot in Boston. We have Schechuan and Tonkatsu broth. With a fresh seafood they have and love the ambience also.", "label": "family"}
{"text": "Very good high end restaurant, go for the halibut, it is a must. Fine decor & ambiance along with quality service. Our 3rd visit in 3 years and the roll well with age.", "label": "business"}
{"text": "walked to the restaurant from my hotel and had dinner there with a co-worker. classic surf and turf menu. I ordered the filet mignon rare and it was done perfectly. The baked potato with the works was fantastic. Overall good food, service was OK. A bit overpriced but I would go back if I had a business dinner in the area.", "label": "business"}
{"text": "This was my last night with my group in Boston after the conference. The location is convenient. The atmosphere in the restaurant is classy one. Good recommendation from the waiter, including a King Salmon caviar with tartare, and a crispy fried white fish fillet. Worthwhile to spend a night there!", "label": "business"}
{"text": "Very small place, but we arrived just after opening, and had no wait, but there was definitely a line by the time we left. The food was amazing and the staff was friendly and attentive!", "label": "family"}
{"text": "First trip to Boston and the first restaurant I go to knocks it oit of the park. What a super cool place with the most amazing Osso Bucco", "label": "business"}
{"text": "Atmosphere- excellent,cozy. Service- almost perfect. Our server John was flawless through the service and only faltered by making us wait too long to get our check when we were ready to leave. Subtract 1/10 of a star if you must. Food- perfect. My wife had Salumi appetizer and the bolognese pasta. I had the prosciutto pasta appetizer and the Osso Bucco. All were 5 stars and paired perfectly with our bottle of Amarone Castellani. Presentation was pure art!", "label": "romantic"}
{"text": "Everything was Perfect! I’m amazed to read the last review as I visited on Saturday night and whilst the restaurant was packed the service was great, got everything right; courteous, professional and punctual. The food was high quality and they also had a great wine list. Not cheap but worth every cent. Big thank you to the team and I’ll definitely be back next time I’m in Boston.", "label": "romantic"}
{"text": "I attend trade shows in Boston a few times a year. Morton's is always a good choice for business associates and clients. The staff is very accomodating, and the food is never a let down. We enjoyed the oysters and the steaks as well as a some red wine. There are many choices in the seaport area, but you can count on Morton's for a classic & enjoyable dining experience.", "label": "business"}
{"text": "We wanted a nice Italian dinner in Boston, but also wanted to see the NHL playoff game between the Bruins and Islanders. At Tresca we found both! The Seafood Fra Diavolo is the ultimate if you like seafood with spice! The Conundrum Red Blend was very good. Tiramisu (picture 4) was nice. Service was excellent, even when busy.", "label": "romantic"}
{"text": "So Mistral is #1, the best restaurant in Boston according to TripAdvisor. We went there for a special occasion and I have to admit our expectation were pretty high. Well, they didn't live up to these expectations. The food was OK but it is not by any means great or creative. The decor is nothing to be exited about either. I would have given them 3 stars if not for the way the wait staff comes across as patronizing. For this kind of money they should be tactful. It is a very expensive place. This place is for you if you are rich and can't really tell a good meal from a great one.", "label": "romantic"}
{"text": "Went to Prezza for Valentine's Day, the bread pudding was great but other than that I can't say much nice about the restaurant. It was busy, and so loud it was hard to carry on a conversation with the person accross the table. One of our salads tasted like they forgot to wash the lettuce. The pork chop was a flavorless, over cooked, shake and bake, the Ravioli di Uove was nothing special. When asked how our dinner was I said the pork chop was not very good, the waitress said she would tell her manager. She came back later (much later) and said they were sorry and were going to comp my drink. (very nice of them to comp a low cost, high profit $12 drink and charge me for a $120 dinner that was no good) We never saw a manager even though there were plenty of them standing around. I guess they figure that they might as well get my money while I am in town since I won't be a repeat customer. MY SUGESTION TO DINERS IS TO GO SOMEWHER ELSE. And to the restaurant.. If you are going to stop giving good service and good food at 8:00 then you shoud close at 8:00, don't the patrons that wait to eat at your restaurant late deserve better or at least the same quality and effort.", "label": "business"}
{"text": "Our first morning in Boston started with an amazing breakfast at the Friendly Toast. From delicious omelettes to pancakes the size of your head, it definitely has something for everyone. The staff are as friendly as the toast! In fact we loved it so much we went back for dinner the next day!", "label": "family"}
{"text": "Tresca is like an excellent red wine - better with age. Inviting ambiance, attentive service, and dishes that transport you to your favorite trattoria in Italy. Do not miss the meatballs - you will regret it if you do. The veal chop is delicious and will feed you for days! If you enjoy seafood try the Fra Diablo. Large amount of expertly prepared lobster scallops mussels shrimp and calamari in a delectable spicy sauce. Save room for dessert. Recommend the freshly made donuts. Tresca is a gem you want to go back to again and again.", "label": "romantic"}
{"text": "Service was a bit slow, but not slow enough to make it lose a star. There was a crazy Italian festival going on the Sunday we were there. That was outside. The restaurant itself was very quiet and intimate. And the food was delicious!!", "label": "romantic"}
{"text": "Hubby and I made reservations for Valentine's dinner. Our table was lovely, as was the server, and the restaurant is gorgeous. Food however did not impress us equally. I ordered salmon. Was specific as to how I wanted it. Not raw. It was raw. They made a new one. Cooked fine, but it seemed rushed and lacked spices, very bland. Just not what I anticipated. Hubby had beef, he enjoyed his I think, but he didn't rave about it. For this class of restaurant, it should be perfect. We have been here in years past, and we loved it, which is why we came back. Unfortunately, we will not be back.", "label": "romantic"}
{"text": "We were happy to return to Sorellina for the first time since the pandemic began….our favorite restaurant in Boston, and it was as great as ever. The delicious cuisine of Chef Jamie Mammano; excellent service; beautiful and romantic as ever. Loved their innovative presentation of one of my Italian favorites….vitello tonnato….veal and tuna with tuna sauce…..on this plate very thin slices of perfect veal tenderloin and yellowfin tuna with dots of tonnato sauce. The pappardelle….saffron pasta with shreds of osso buco, bone-marrow butter and gremolata was incredible! Highly recommend!", "label": "romantic"}
{"text": "Really good French inspired cooking. Portions in the American way. Big and quite industrialized, no individual passion but a very good standardization of solidly reliable good food.", "label": "romantic"}
{"text": "Do NOT order the white truffle pasta dish $ 95 for buttered egg noodles you got in the school cafeteria No aroma No taste Old or bad or ? Truffles They should be ASHAMED to serve this dish I should have sent it back after smelling it = no aroma I made the mistake of eating it snd hoping for some flavor Oh well never again = HERE", "label": "romantic"}
{"text": "During my stay in Boston I came to this restaurant of Seaport motivated by the positive comments I read on TA. Sorry to tell you this but I was quite disappointed : location is very ordinary (zero view), interior decoration is standard, food is good but neither great nor fine cuisine, service is slow, servers are not very friendly and the food is SO expensive. You won't find any seafood below $40 (before tax and tips). Sincerely, I think this place is overrated and I'm quite sure you can find better restaurants at more reasonable prices.", "label": "business"}
{"text": "This was our second visit. Last time we found it and this time we made sure we went back. From beginning to end everything is first class. Of course, the warm crusty bread with a soft chewy texture inside is a perfect start! If nothing else go for the bread. We did!!!", "label": "business"}
{"text": "Asked a local for a great recommendation and suggested PREZZA. Checked it out on TA and felt pretty sure I was going to have a great meal for a business dinner. They Delivered! Luca provided great service and walked us newbie’s thru the restaurant favorites. So with the zucchini flowers in season we shared that and the squid w/navy bean appetizers. Both excellent. For dinner, I had the Lamb chops and by far one of the best I’ve had. The two thick chops sat on top of sautéed zucchini and squash on a light marinara. Finished off with cappuccino and the white chocolate bread pudding. Great atmosphere, food and service. Can’t go wrong... thanks for a great evening.", "label": "business"}
{"text": "What a spectacular evening, outside, full moon and great food with family. Start with a nice cocktail and enjoy. The Cesar salad I started with was great and I loved the rope pasta I had and it was even better as leftovers. All the staff was very nice and helped us celebrate a birthday. If you haven’t been here you should get out now before the crowds. And plan ahead as you may have leftovers.", "label": "family"}
{"text": "Mistral is a highly acclaimed, upper class \"French\" restaurant serving Mediterranean food. I went there on a business outing with two colleagues. We knew it wasn’t going to be inexpensive, but we were nonetheless caught off guard by its prices, and it made us a bit uncomfortable when we ordered. Business may be booming, but there are still limits on how much you can splurge. We exercised the utmost corporate restraint and ordered three lower-priced entrees and the only reasonable bottle of wine we could find in the $50 range. An Australian variety, it was actually excellent -- 2011 Pinot Noir, ‘Little Yering’, Yering Station (Yarra Valley). Highly recommended! All three of our entrees were attractively presented and delicious. Mine, the “WHOLE ROASTED” DUCK & WILD MUSHROOM RISOTTO, DRIED WISCONSIN CHERRY GASTRIQUE,” was the best duck I’ve ever eaten – crispy yet moist and juicy. A perfect potpourri of flavors with the Risotto and Cherry Gastrique! My two colleagues had “PAN ROASTED NATIVE HALIBUT WITH CHANTERELLE & ZUCCHINI BLOSSOM RISOTTO, SWEET SUMMER CORN” and “PAN ROASTED CORNISH GAME HEN, WARM PANCETTA & SPINACH SALAD, LEMON & ROSEMARY”, respectively, and I wouldn’t have complained if I had been served either one. The restaurant didn’t strike me as very French, however, and that’s what we were seeking. Outside of the culinary influence which is more on the higher end than most French can experience on a regular basis, there wasn’t anything about the atmosphere reminiscent of the world’s cultural and esthetic powerhouse where I once lived. None of the staff (that we saw) was French. The bread wasn’t French. The decorations weren’t French. While I wasn't looking for an Eifel Tower upon entry, if you’re going to call yourself French, at least try to showcase a token receptionist or waiter with an accent! Mistral's serves an expertly-cooked meal in a low-lit environment that’s a bit stuffy and pricey for my taste. Most reviews in Tripadvisor have been more than positive, so this is clearly a restaurant of consistent quality for special occasions or high waged earners who aren’t intimidated by the $55 “market price” for the undoubtedly scrumptious ROAST RACK OF COLORADO LAMB WITH SUMMER TOMATO & BEAN SALAD, FETA & KALAMATA OLIVES! I won’t return, but that doesn’t mean you shouldn’t. Of course, I wonder how many potential patrons of Mistral need TripAdvisor to guide them on whether or not to eat there!", "label": "business"}
{"text": "A great dinner with couples in the North End. Prezza is a jumping spot on a Saturday night. Modern seating with booths and tables, a lively place with a very sufficient staff that provides great service. Extensive wine list (I love that) and a nicely varied menu with a somewhat modern approach to Italian (I.e. no chicken parm.). Well executed at every stage. I had a fabulous Bronzino and the chicken and the meatball entrees were also enjoyed. On a list as a best Italian in Boston - I see why.", "label": "romantic"}
{"text": "We went here last night for our anniversary. Started with the tuna tartare and it was so delicious! I had the duck and my husband had the sirloin and they were both perfect. We got sides (whipped potatoes and broccolini) and they were also great, but honestly didn’t need them as the dinners were quite big. Our server recommended an excellent wine. We were asked making the reservation if it was a special occasion and we wrote anniversary but they didn’t say “happy anniversary” so I’m not sure why they ask for that? No big deal really just call if you really want your special occasion noted as the online system might not be noticed. Our table was very close to our neighbors table, that was the only less than perfect part of an otherwise really nice meal.", "label": "romantic"}
{"text": "I took the meatballs; my colleague took the veal. Meatballs were good but veal looked amazing. I made the trade - one meatball to taste the veal. Veal was fantastic. My guests loved the food; the restaurant and the service. Good night. Not cheap at all but fantastic.", "label": "business"}
{"text": "Ate here in 2012 and my lunch was just as amazing again today. Definitely a must eat place when in Boston", "label": "family"}
{"text": "We’re picky about Italian. Came at 5:30 and waited 30 min for a table. Handmade gnocchi, seared scallops, shrimp, chicken marsala were perfect. Shared choc cake was yum!! Lots of leftovers for tomorrow’s lunch. You can also buy their pastas and sauces to cook at home. Highly recommend!", "label": "family"}
{"text": "Morton's is 100% the real deal. Service is exceptional, the place is relaxing and the food is phenomenal. The sundae was massive! Filet perfectly done, the sides are enough for two and as tasty as the mains. Thank you! This place shows their guests how it's supposed to be done.", "label": "business"}
{"text": "I ordered a so called warm spinaces salads at your restaurant located at the Bos Logan Airport and thats what I got. The spinaces or any other component were not warm. A restaurant of your caliberber should be embarassed to serve a salad like this and charge 15 dollars for it.", "label": "business"}
{"text": "Had dinner at Grill 23 and the staff acted as if we were bothering them by being there. The food was satisfactory. It's back to Capitol Grill for me.", "label": "business"}
{"text": "Had dinner with a colleague and ordered the rib eye. Asked for it to be rare and it came out on the other side of medium rare towards medium. $54 for a single course and no sides without cooking the steak to order is a bit rich. Having the waiter running around after asking if everything is alright misses the point as I want to eat dinner not complain. I cook a lot of meat at home, use a thermometer and turn out better meat than I had.", "label": "business"}
{"text": "Saw the great reviews and ventured back to the North End to try this place for breakfast. Didn’t have reservations but they were able to seat us at the bar right away. As we waited with coffee, they bring over a dish of the BEST banana bread I’ve ever had. I would have ordered just that for breakfast - but I didn’t. I got the Crab Benedict and J got the regular eggs Benedict. I got the potatoes with peppers, onions, and cheese and would highly recommend getting them that way. Delicious! Great breakfast, fast service, and friendly staff. Note: They do take credit cards and there is outdoor seating. I’d make reservations next time.", "label": "family"}
{"text": "We had greatly looked forward to our return to Deuxave, but the experience this week was mixed. Mrs G did enjoy the recommended Spiced Long Island duck breast, but my Herb-crusted Cod entrée was bland and disappointing. More annoying still was the fact that the clams included with the dish had the texture of rubber, and were frankly inedible. Not to be expected in a restaurant of this caliber! An off night perhaps, but we’ll not soon return.", "label": "romantic"}
{"text": "My spinach ravioli was fair, sauce was too heavy for me. My family’s meals were huge and they couldn’t even eat half. It would be nice if they offered half portions for less. Service was ok.", "label": "family"}
{"text": "Our group waited almost an hour for appetizers after ordering them. The restaurant did not charge us for them -- but the wait completely destroyed the dining experience. All told, from seating to leaving, dinner took 3 hours. The food was really good (not exceptional), but this morning all I can remember is the helpless feeling of being forgotten in a not full dining room. Really a disappointing experience.", "label": "business"}
{"text": "Had some hiccups when we had actually got a confirmation on our reservation through opentable but the host at the door kept denying it. After showing our reservation and repeated requests he finally allowed us to sit in the bar till a table opened up. Later on he told us that his phone indeed showed that we had our reservation. However his tablet was disconnected so he was going by it. That kind of soured it for us since it was extremely cold outside and I thought he lacked empathy on customers. All this while our group of 2 cars had done valet parking for $50.", "label": "business"}
{"text": "I loved Ostra! The food was beautifully served and the tastes felt like they were straight from the Mediterranean ... simple, fresh and clean. The atmosphere was upscale, no doubt, but not in a \"unrelaxed\" way. The high ceilings and sand, brown, white colors made it a great and stylish set-up. Service was friendly and professional. Great for business, great with friends or great for a romantic dinner .... take your pick! I will be back!", "label": "business"}
{"text": "We visited this afternoon and were seated next to a table by the window. The view was very scenic and relaxing. We ordered the crab spaghetti and lobster risotto and found both to be delicious. The main positive aspect of our visit was the service. Abdel was friendly, knowledgeable, and made our meal an experience. Thank you again.", "label": "romantic"}
{"text": "I was in town with clients for a conference and found Davio’s near our Copley Plaza hotel. First, the wine list is extensive and priced well, many top choices and our server knew the wines we inquired about well, helping us make great selections. The lobster risotto was out of this world. The fresh hot popovers were a nice surprise for the table. Our server was smart and efficient. I can’t imagine a finer experience.", "label": "business"}
{"text": "La Summa is a phenomenal family owned restaurant. The entire family works at the restaurant. The owner lives across the street, and looks out her window to make sure the service is up to snuff. PRICELESS! If you’re lucky, Barbara (owner) will come out, cross the street, and talk to you. Our wine was amazing, and our food was cooked to perfection. My wife had the baked manicotti, and I had the tagliatelle with red sauce and meatballs. In a male dominated North End, La Summa is owned by a female entrepreneur who has run the restaurant for 40 years. Do yourself a favor…Take a turn off Hanover Street onto Fleet Street to get a real taste of Italian in the North End.", "label": "romantic"}
{"text": "We tried the Capital Grille for dinner based on Trip Advisor reviews and we were not disappointed. This restaurant is primarily a steakhouse, but there are lots of other options. We started with a seafood platter for 2 which came with oysters, jumbo shrimp and lobster. It was presented beautifully and tasted amazing. For the entrée we opted for a bone in ribeye and fillet minion at at servers recommendation. Both were cooked perfectly to our requested temperatures. The sides are huge! You really won’t need more than one for a couple. The restaurant was busy even on a Wednesday night, which speaks volumes in itself. I definitely recommend making a reservation in advance. The whole place had a lively vibe. Would highly recommend giving the Capital Grille a try if you like seafood and steak. We will definitely return.", "label": "romantic"}
{"text": "We’ve been here multiple times and have never been disappointed. Ursula, the owner makes you feel like you’re at her home. We have an 8 year old and she treats her like her own. She is so welcoming to families. The food is always consistently excellent. One of our favorites is the Lasagna. We drive over 20 miles to eat here and pass many Italian restaurants along the way. Last month she catered a communion and the food was out of this world. Guests kept going back for more and more food. Definitely a must try.", "label": "family"}
{"text": "Hands down one of the best spots in town. Been many times - it is expensive but that is what it is. Great for dates. Good business relationships though could a bit too intimate for a first meeting depending on your business and the other guest. Good is excellent each time I've been and service is top shelf.", "label": "business"}
{"text": "Well located, friendly staff, tasty food and cold beer. By no means a fine dining experience (which seems what some other reviewers were hoping for) - if you were expecting this you were ill-informed and a bit silly. I really enjoyed it evidenced by visiting it for a second time in two trips to Boston.", "label": "family"}
{"text": "We’ve spent a lot of time in Italy. This restaurant is the closest you can get to an outstanding family run Italian restaurant without going to Italy! Everything about La Summa was excellent. Ambiance, hostess, server, food and price. Would give it six stars if I could. Highly highly recommend this very special family run restaurant.", "label": "family"}
{"text": "Pasta bolognese is literally the best pasta I’ve ever eaten. The noodles are a dream. Husband had veal Parmesan and loved every bite. Not to mention the hospitality and homeiness was bar none. Would recommend this place to any and everyone.", "label": "family"}
{"text": "Prezza has been great for a long time. My recent visit for a small party allowed me to try a bunch of stuff.. all great. Arancini,Pasta with sausage and greens, meatballs and the amazing fried shrimp were my favorites. Great staff here!", "label": "romantic"}
{"text": "With GF restrictions we have experience with FT in Portsmouth. So when in Boston for a long overdue weekend we knew we could rely on good GF options with FT. Nicole in the Boom Boom room took very good care of us. One piece of advice the Nowait app is a PIA and does not load in the city. Take the time to put your name in for a table then walk the back bay neighborhood for 30 minutes or so. You don’t be disappointed.", "label": "family"}
{"text": "we had a great meal in a little dining room on the second floor overlooking the square in front of the restaurant ; waiter knew his stuff and gave some very good recommendations regarding food and wines ; had lobsterfilled ravioli for entree which were very god ; other guest had the osso bucco which seemed great . Only less positive point was the cool air which blew in my neck and came from some badly insulated window behind me but all in all this was a great dining experience in a nicely restaured old house !", "label": "business"}
{"text": "We first had a pistachio martini that was fantastic! Then I ordered penne bolognese that was out of this world. The waitress allowed me to order the child sized portion because their adult portions are huge and I couldn't take it with me! My son ordered La Famiglia Special that was fabulous. The wait staff was very good and accommodating. I'd highly recommend it!", "label": "family"}
{"text": "Excelent food! Good value. Just a perfect place to eat a perfect meal. You should choose The hot pot.", "label": "family"}
{"text": "Beautiful setting, so many creative choices. Excellent service and truly delicious food. The halibut was pure white. Carpaccio was melt in the mouth and the peach tart was flaky and not too sweet. One of our best meals anywhere!", "label": "romantic"}
{"text": "Mistral never misses a beat, every time we are in Boston we eat here, we took our friends and they love it. We ordered the mussels and escargot for an appetizer which both were really good. For dinner I ordered the haddock which was pan seared over a lobster risotto that melted in your mouth. For desserts we ordered the valrhona chocolate cake which was delicious. We did not order wine this time but they do have an extensive list. The service was amazing and not rushed.", "label": "romantic"}
{"text": "We absolutely loved Mistral. The warm, upscale ambience, beautiful furnishings and decor, exceptional service, and of course the amazing food. We chose Mistral for our anniversary celebration and it was perfect. We enjoyed everything from the bread to dessert. Highly recommend!", "label": "romantic"}
{"text": "This is a back bay gem with charm, great food and most of all, exquisite service. We had the good fortune of having both lunch and dinner on a recent Boston visit in December. The food and wine are amazing and the servers go out of their way to make sure everything is perfect. We’ve had the soup, apps and steak frites. We’ve sat in the Charming main dining room and at the bar. They are both wonderful and it is a pleasure to dine there. We can’t wait to return!", "label": "romantic"}
{"text": "Nothing exceptional. Edamame was barely warm and under salted. The shrimp with fresh mango was lukewarm and covered with a sickly sweet bland sauce. The sushi rolls (we ordered 4 different ones) were fine, just nothing with a wow factor. The service was very poor. Had to beg to get water refilled, entrees came out before appetizers, waiter spent a great deal of time flirting with a table of twenty-somethings and ignored the rest of his section. We won’t return", "label": "family"}
{"text": "The food was awesome and the service we received from out waitress Sam was top notch. We asked for and were given a table on the street. Before our order arrived it began to rain. The staff very quickly moved to make sure they were able to relocate us to a table inside. While the food was 5 star worthy, the service and concern for our total satisfaction earned 5 stars from me. Be sure to check this place out when in Boston!", "label": "family"}
{"text": "Wow great service with authentic food. Seriously great service. I wish I remembered our servers name. He was very professional. Everything we ate was delicious and amazing. My husband loved the lamb gnocchi and the rabbit pasta. My delicious app and dinner was the grilled calamari and octopus and the lobster agnolotti pasta. Outrageous and delicious. Delicious Italian bread and cocktails a plus. It was a perfect birthday celebration for my husband while visiting Boston. Thank you", "label": "romantic"}
{"text": "The food at La Voile is competent French cooking. We expected more. The wonderful, nuanced, multi-layered sauces that characterize the best French offerings were missing from our two entrees: the duck and the beef fillet. The stock in the French onion soup tasted like it needed at least another hour simmering to develop the richness we expected from an establishment with so many positive reviews. The pumpkin cream soup arrived luke-warm. The mousee for dessert was lovely, but why spoil it with a chocolate drizzle of inferior quality? While the service was attentive, this is an inconsistent restaurant that we would not visit again.", "label": "romantic"}
{"text": "Have been to Al Dente's numerous times over the last two years or so. Have always gone at lunch time and have always found the service to be good and the food to be delicious. So when nine of us went to a matinee, we made reservations to go to Al Dente. While its small, we figured that by making reservation for 5:30 pm weeks ahead of time that they would plan accordingly. The day of the show and dinner, I received a call in the morning verifying that we had reservations at 5:30 and that if they did not hear from us that there was no need to call back. We got to Al Dente at 5:30 on the nose and it was as if we never made reservations. The host asked us to wait outside in the snow and cold while they scrambled to set up a table. All the while the host was mumbling under his breath relative to our arrival, as if we were inconveniencing him? He set up the table in the middle of the floor where there was clearly not enough room for us to eat comfortably or the wait staff to get by. When we confronted him on the placement, he became rude and beligerant. Too bad for him that we told him to keep his table and went arounf the corner to Saracenos and had an excellent meal. Won't be going back or recommending \"smileys\" restaurant anytime soon. Must be nice blowing off a thousand dollars worth of business that you should have expected?", "label": "family"}
{"text": "Easy to find, line wasn’t long on a Friday afternoon….. Reuben and a Cuban with 2 bottled sodas cost $50 and I wasn’t even mad about it ! Super delicious, sat outside in the gorgeous Boston summer sun, and a good time was had by all.", "label": "family"}
{"text": "Came here after seeing all the positive reviews on TripAdvisor. Ordered the equivalent of a regular regular burger and was quite disappointed with it. It looked like something that really didn't take much care to prepare and boy was it greasy! And dry inside too. This was probably one of the most unappetizing burgers I've had. Talk about the grease, on the way to the restroom I almost slipped because the floor was like a grease-pan! Not coming back. Neither will my guest.", "label": "family"}
{"text": "Made reservations for a Saturday night (830pm). We arrived about 20 mins early and were seated right away. The indoor seating is intimate as there are only about 20 tables. They do have a sidewalk patio as well for those who prefer the outdoors. The service was attentive and most excellent! My son and I ordered the chicken Parmigiana and the veal parmigiana. The serving size was generous to say the least! Home cooked and delicious. Would absolutely return if we ever set foot in Boston again.", "label": "family"}
{"text": "I heard so much about this place,I had to try it out. Mario’s lives up to the hype, laid back atmosphere, delicious food, great servers. All the team there made us feel right at home, a great welcome and quick service all the way", "label": "family"}
{"text": "We thoroughly enjoyed our meal in this romantic little restaurant. The service, food and wine were perfect. We enjoyed the special cheese ravioli appetizer (could have been a meal option), seafood pasta, pasta spinaci and bottle of wine (red blend). The food was delicious (portions perfect, if not large). We did not have a reservation. We arrived at 7:45P on Thursday evening, and we were seated right away. There was a group of maybe 12 people at several tables moved together to accommodate them, but otherwise it was 2-4 people per table due to the size of the restaurant. Depending on the time and day they can possibly seat a larger group. We felt fortunate to have stumbled upon this gem of a place. Total for our app, meals and wine was $97 which was not bad considering the quality of the food and service. Enjoy!", "label": "romantic"}
{"text": "What was once a 5 star restaurant is now average at best. The caliber of the wait staff has slipped. The back up staff was rude & most times vanished .But the biggest disappointment was the food. At one time it was the best of the best, now I wouldn't recommend this restaurant. The prices are now more expensive then NYC. The décor has not changed in 20 years needs a major face lift.", "label": "romantic"}
{"text": "Quaint bar like atmosphere. More ways to dress a burger than the imagination can come up with. Food was prepared well. The shakes we're the highlight of the visit. You cannot go here and not get one.", "label": "family"}
{"text": "My family stopped for lunch here while on vacation, and we decided to try some seafood. Neither I nor my fiancé like clam chowder, but we decided to give it a try by sharing a cup. Absolutely loved it! It was creamy without have an overwhelming clam taste, and the dill was a great mix of flavor. We also tried a lobster roll, which was good. And the Boston cream pie was delicious. Definitely worth trying.", "label": "family"}
{"text": "Went there with a friend for dinner. Service was average. Interesting note: we handed our server our card to pay the bill. We were offered a free dessert if we paid in cash! We got a huge piece of chocolate cake as we were able to scrape up enough money for our bill. Oh, and note: DO NOT order cocktails. I think I paid $11 for a pear grey goose cocktail. GROSS! YUCK! Portions were big!", "label": "family"}
{"text": "Business dinner for 12. Expense account, so we went wild. Man was it good! Service is perfect fine dinning. Fun extensive cocktail menu, wonderful wine selection. Appetizers were great, steaks and seafood amazing Huge thumbs up.", "label": "business"}
{"text": "As you walked through the glass double doors you are greeted by a smiling host who offers to take your coat after checking you in via the modern computer system. I booked through open table on my first visit many years ago and was a seamless welcoming procedure. The candle lit table and dimmed atmosphere filled the restaurant with a warm feel even during the colder months in Boston. The food was delicious with my personal favourite being the roast chicken or rack of lamb, and of course the soft shell crab ( when in season). The wine list is huge and fabulous collection of American wines. Watch out for the bread, well more of a yorkshire pudding, served in a basket whilst still warm and fresh. Its surprising how many you can get through with a light covering of butter. I actually had to ask the waiter to stop topping up the basket as I could've gone on eating them for hours... and you don't wait to be too full for the dessert trolley; the tiramisu is delicious!", "label": "business"}
{"text": "It was worth the wait. we had to wait about 30 minutes (go across the road to the coffee shop). but the food was plentiful and good. The waiter made good recommendations.", "label": "family"}
{"text": "Just had a wonderful team dinner at Ostra tonight. Great food, wonderful wine option, paired with attentive service. Our group was large - ended up at 19... This is where Ostra shined. We had started the day with 17, then dropped to fifteen. Ended up with 19 people, a bit of a surprise. Ostra’s staff was friendly and flexible throughout as we figured out what the true size of our party really was. Excellent job. Very much appreciated the flexibility and patience.", "label": "business"}
{"text": "Usually unimpressed by “worth the wait” BUT this gem is WORTH THE WAIT. Get on the reservation list and walk around Little Italy while you wait. The food is delicious and huge portions. The chicken and waffles sliders have the best syrup with a kick. Everything looks beautiful.", "label": "family"}
{"text": "Do not miss this place! Recommended by a local and did not disappoint. Our waiter Nate was amazing , couldn’t do enough for us . The food was fantastic and definitely lived up to the kids expectations of American food . Well done all xx", "label": "family"}
{"text": "I wanted to love this place. Very nice restaurant but VERY loud. A lot of reviews mentione that - completely accurate. Conversations will be almost impossible. So will a decent meal. The reason I won't return is that when you charge $67 for a dry aged steak - you really need to have someone in the kitchen who knows how to cook it. If you like rare steak - the meat quality is superb. But if you want it cooked any other way - go elsewhere. A steakhouse cannot be judged superior if they cannot cook your steak EXACTLY how you ordered it - the first time. There is NO EXCUSE for anything else. Too many truly superb steakhouses get it right the first time - never mind having to send it back to the kitchen not once but twice. Too, if you're going to employ a sommelier he should be able to decant wine before the meal is more than halfway over. The tater tots were interesting. The mushrooms were awful. The grilled asparagus was superb. But if you can't get he steak right - no reason to return.", "label": "business"}
{"text": "My family loved this quaint, cozy Italian restaurant on a side street in the North End. Our waitress Sharon was attentive and gave us great recommendations. Everything was delicious. We had the special gnocchi, the lemon chicken, and the veal Marsala special. Our teenage son had fettuccine Alfredo and was happy. The calamari was lightly breaded and tasty. We loved the mussels in white sauce - the best I’ve had in a long time. Our wine selection was also perfect. Sharon recommended it. Very affordable. The only dishes that were just okay were the stuffed artichoke and the bruschetta (in our opinion). This is a great escape from the crowded north end main drag. The meal could go as slow or fast as you’d like. We lingered after our apps and then ordered our entrees. The table behind us was there when we got there and still going strong when we left. Definitely give it a try! Would recommend you make a reservation, but I’m sure you could walk up and chance it. La Summa was a great dining experience for our family - just what we wanted and expected!", "label": "family"}
{"text": "Great place to have a business dinner .Food was delicious Service was great..Try the Pork Chop the sauce on PC was amazing", "label": "business"}
{"text": "Visited here on a snowy December evening and it was magical! The decor is inviting, looking out over Boston from the 2nd story window was beautiful. Service was perfect and the food delicious. Thank you for a memorable evening!", "label": "romantic"}
{"text": "I was taken to Mistral with a team of business colleagues and external support partners for dinner this week. I've eaten at many fine establishments in Boston including Menton, Abe and Louie's, Ostra, Oleana, Eastern Standard, Asta, Scampo, Yvonne's and others, so I am familiar with the food scene there. As a foodie I am very cautious about reviews and restaurants living on last laurels, or being to costly for the fare, etc. I thought Mistral was elegant but understated, the service very professional, the wine list pricey (states with liquor boards force much higher wine costs thanks states that don't, as where I live), but the wine by the glass list was functional and diverse. The fact they offered a car service back to the hotel was very impressive and I haven't seen that before. I also thought the pricing was actually very competitive based on the portion size and food quality. A few noteworthy mentions. The seared foir gras on a cherry reduction sauce, with duck confit and on a small, hollow bread tower was perfectly cooked and slightly more peasant-like in preparation than I've come to expect- which is Provençal style and was perfectly cooked. The glass of Sauternes served with it was about $18 and well worth it, and not terribly expensive. The Dover Sole was I have to say, hands down the best prepared, thickest, freshest, and richest tasting Dover Sole I've experienced- here or in Europe. Really. The butter sauce was light and airy, the spinach perfectly cooked. And I've eaten at many world class establishments so this is a serious review. Someone had their sirloin carpaccio with Parmesan shavings and ramps?, and the sliced meat was mouth watering. And the truffle oil on top was evident and and not under-represented which is often the case in similar dishes I've experienced elsewhere. My Cornish game hen was outstanding. It was practically the entire bird, breast up, and served in a metal roasting pan and in a buttery broth with spinach, garlic, and pancetta for that smokey hint if added flavor. Again, I am a bit shocked as it was the most flavorful interpretation of this simple dish I've had in maybe 20 years. Even the sides of mashed potatoes and an asparagus-crab risotto were perfectly executed and dish in flavor and texture. I will be back with my wife the chef and see what she thinks! Mistral is deserving of its excellent reputation from my one time perspective, that's for sure!", "label": "business"}
{"text": "We had one day in Boston and went here based on the reviews. The wait was an hour, but you don’t have to hang around the restaurant. In fact, we walked back to the hotel. They give you a ten minute grace period after they text you your table is ready. The appetizer sampler was the way to go. All four of our meals were also delicious. We’d be regulars if we were Bostonians.", "label": "family"}
{"text": "I love the Brant Beef they serve but was anyhting but impressed with the 100 day aged ribeye, Didn't know it was wet aged...Don't waste your time with this steak as it is a waste of perfectly good meat. They could dry age for 14 days and achieve a much better steak. but instead they go for the sexy \"100 day aged Ribeye\" description on the menu and dissapoint. Don't get me wrong...this place is awsome but stick with the dry aged NY strip it won't dissapoint.", "label": "business"}
{"text": "Excellent service and food. Our waiter was attentive and informative without being overbearing. If I had unlimited funds I would be here every week....", "label": "business"}
{"text": "Overall experience was very good - service, courtesy, ambience. But I wouldn’t rate it #1 in Boston area. The quality of steak doesn’t live up to the hype. Also, the cocktail I ordered (Old Fashioned) leaves much to be desired. I had to return it twice and eventually got a glass of Cabernet.", "label": "romantic"}
{"text": "The North End of Boston has its fair share of tourist traps for Italian food, but this isn't one of them. Just off of Hanover (on Fleet), this place is special. It's where the locals go. Handmade pasta, extensive wine list... I had a hard time deciding on what to eat. Settled on a roasted beet appetizer followed by two appetizer portions of pasta for main meal. (Because I couldn't decide!) Pear and ricotta stuffed ravioli with braised rabbit and a bolognese with gnocchi. Great Brunello to accompany the meal. Service was outstanding. Server even gave suggestions on where to go post-meal to enjoy live music in the area. Great atmosphere. Will be back next time in Boston as there is so much more to explore on their menu... and wine list!", "label": "business"}
{"text": "Went there for dinner after a long day of difficult business travel. Just a super experience. The food was out of this world. I had the salmon for entree and easily the best I've ever had. You can't go wrong with ANY of the desserts. Nice perk - if you are staying within 2 miles of the restaurant they offer complimentary pickup and dropoff service. My work budget doesn't always allow for this level of restaurant but when it does when I'm in Boston I will be back to Ostra.", "label": "business"}
{"text": "Just slightly off the beaten path, a block or so away from the main drag. Friendly staff, great house wines, cool Al fresco seating (but the inside is cool, too), top notch food (try the pollo especiale) and a good price. Can’t wait to come back!", "label": "romantic"}
{"text": "Had business dinner here at 7pm midweek. Restaurant was crowded but not packed. Nice space, booths, and plenty of seating at the bar. We asked waiter to bring us tasting menu with wine pairings which we happily provided. 4 courses of high quality food. Nothing to complain about. Try the gnocchi!!", "label": "business"}
{"text": "Best delivered food we have had since being locked in. A little bit of Boston arriving in California. Sandwiches-Reuben, pastrami, turkey, ham all arrived well packaged and fresh. Heated up following instructions and they were perfect. Bread not soggy. Meat was outstanding. Well done Sam Lagrassa’s. The real deal!!! Thanks for Goldbelly for the service too. Overnight shipping was flawless. Cucumber slices were a treat!", "label": "family"}
{"text": "My husband and I dined here for our anniversary dinner while on holiday in Boston. Our waiter, Dominic, went over and above to make it a memorable and enjoyable dining experience. The food was absolutely delicious. We have dined at other Capital locations in Miami and Las Vegas, however this location was certainly a favorite! The prices are also very reasonable and the food is sublime. Be sure to make a reservation as the restaurant fills up quickly!", "label": "romantic"}
{"text": "Ravioli and duck was fantastic. Creme brûlée with pecan brownies were as expected. My boss had the mushroom soup which seem boring. Then he had the pumpkin ice cream which from one sample as good. Get the meatballs for appetizer - delicious.", "label": "business"}
{"text": "Hands down the best eggs Benedict ever! Loaded with nice chunks of lobster and eggs were perfectly done!", "label": "family"}
{"text": "Just got done with Valentines Dinner at Tresca. 3 course plus desert and could not rave enough about the quality, service was top selves. Beautiful place at a very reasonable price. Chef/owner Rich stopped back and is very pleasant.", "label": "romantic"}
{"text": "We had a early dinner while staying in Boston and visiting the North End. The antipasto salad was huge and the eggplant rollatini was delicious. The marinara was great. I had the veal parmigiana with fresh pasta. I recommend if your in the area.", "label": "family"}
{"text": "Amazing food! Appetizers and entrees were phenomenal. We even ordered a couple sides and loved it. We, unfortunately, did not have any room for dessert, but the dinner was so worth it anyway! Very clean and very polite staff, as well. The dress code says business casual, and we complied, but a large group of younger tourists did not, but they were seated there anyway.", "label": "romantic"}
{"text": "I took my husband to Sorellina in Father’s Day! I love the atmosphere, the food, the desserts and the wines at this restaurant. Our waiter was friendly, helpful and knowledgeable about wines and the meals. Whenever I need s quiet relaxed classy atmosphere I think Sorellina! I highly recommend this high end Italian restaurant to anyone in search of a place to have a special evening!!!", "label": "romantic"}
{"text": "I don't see my girlfriend (my future wife) often because I live thousands of miles away, so when I come to Boston to see her we visit our favorite restaurants and seek out new ones, it was my turn to book, so choose Deuxave, a quite pricy restaurant. Firstly we had to wait for our water, wine and champagne , starters only arrived 20min after ordering them, I had the Duet of Prime Beef Tartare & Wagyu Carpaccio and my partner the Mélange of Heirloom Beets, which was acceptable and then we waited for over an hour for our main courses to arrive, no reason was given why... there was a delay, my loved one ordered the Pan Seared Atlantic Halibut and I Spiced Long Island Duck Breast with a side of Native Bok Choy, Black Garlic Emulsion, Pickled Daikon Radish and this is where it became unsavory excuse the pun, The Halibut was over cooked, she left half, my duck was so dry and chewy it and without taste, I had about 3 bites before I gave up, even my wine couldn't wash it down properly and don't let me get started on the Bok Cho, it was obvious it was in the warmer has long as we had been waiting for our main courses, it was the worst dish that both had ever tasted. The whole experience left a bad taste in our mouths.", "label": "romantic"}
{"text": "the food is good but not great. It is more immitation italian than genuine. Drinks are overpriced. All in all you are paying for the trendy ambiance not the food. If you are looking for high quality italian cuisine you will be disappointed.", "label": "business"}
{"text": "If you are looking for a special dinner out in the North End you can’t beat Mamma Maria. It has it all. Ambiance, excellent food and drink, and outstanding service and hospitality. As someone that’s been to almost all of the restaurants in the North End and has a food tour of the neighborhood that I hav e been running for 10 years, I can say that it’s really the best on all accounts, including best space and location in beautiful North Square.", "label": "romantic"}
{"text": "Grill 23 has all the makings of a very good restaurant. The meals that our group had were really good (although certainly not excellent), the wine list was quite reasonable and the service was ok. But like a few Boston restaurants, it was spoiled by the barn-like atmosphere of a huge room where the din made the dinner less than pleasant. I might give it a second chance because so many elements were very good, but I am sceptical because the design does not lend itself to anything other than being a noisy place. It is certainly not somewhere to go for a romantic meal or for a serious business dinner!", "label": "business"}
{"text": "The best French restaurant I have been to in the Boston area. The service is quick but with a great attention to detail, the food is authentic, fresh, and full of flavour. The only downside is that the space is on the smallish side, so your table may be too close to other tables.", "label": "romantic"}
{"text": "Had breakfast twice during a weekend visit to Boston. First time in this end of the city and also first and second time in the restaurang but for sure not the last. The place is small without the feeling of crowded, it gives you a great feeling of atmosphere. Good classic American breakfast food and top service. Next time in Boston we’ll try them for lunch and dinner.", "label": "family"}
{"text": "We were invited for a EY dinner. Friendly guidance to the separate dining room. Wide variety of drink choices accompanied with good amuses. The fish was very well prepared and tasted delicious. Portions were more than generous. The ice cream was awesome. Wine pairing was good. An enjoyable evening!", "label": "business"}
{"text": "A great dinner in the North End, Boston. Although Mama Maria looks small from the outside, it has many dining rooms, plus outside dining. Packed full on a Monday night ( make reservations ). Our sever, Luis, was friendly and charming. Restaurant was very busy so food took a while. The wait was definitely worth it. Heirloom Tomatoes with fresh Basil and EVO were terrific! Grilled Peaches with Gorgonzola and Prosciutto was also presented beautifully and delicious. Our mains were a Summer Ravioli with Spinach, Corn and Chanterelles and a Roasted Pork Tenderloin with Gorgonzola and Fig Jam. Both were presented beautifully, served hot and excellent. Dessert was a warm rustic Peach tart with Mascarpone. Again, just perfect. We highly recommend this restaurant if you are looking for an upscale Italian experience in the North End!", "label": "romantic"}
{"text": "Make sure to get a reservation on Open Table. Great food and service from a Italian owned and operated family restaurant. Stuffed mushrooms, Caprese Salad, Chicken Soup, Alfredo Pasta, Manicotti, and Specials were excellent. Would return and recommend.", "label": "family"}
{"text": "If you are accustomed to corned beef or pastrami from one of the great delis in New York, Montreal or Toronto ... meh. But if you are from anywhere else in the states this is top notch.", "label": "family"}
{"text": "I am not from Boston and this was my first time in the city. We loved the city but Sam LaGrassa’s made our trip! They have the best pastrami sandwiches ever! Actually everything was delicious. You must come here at least once if your visiting. I am contemplating stopping by again before our flight leaves out. I live in LA and we have many wonderful places to eat but nothing comes even close in my mind to their pastrami sandwiches. The pastrami is just so soft, tender, flavorful and everything you could ever want and more from a sandwich. Once I’m back at home I’ll be planning a trip back here to get some more sandwiches.", "label": "family"}
{"text": "Had a delightful dinner at Davio's, while staying across the street at The Boston Park Plaza Hotel. The service was incredible; attendants to bring food, take away used plates, get the crumbs off the table......you can't do better than that. The food? Everything is home made and delicious. The dinner started with homemade popovers; they were fantastic!! I had a delicious salad with a touch of dressing and a simple pasta dish loaded with fresh tomatoes and sauce. The prices for such great food and service were more than fair, and I look forward to returning.", "label": "business"}
{"text": "The manager was very obnoxious in speaking to his guest on a matter that was being queried Also they take your plates even before you finish eat The worst part is they throw your plates on the table I can get better service at KFC", "label": "business"}
{"text": "Terrific meal and experience. Food was terrific and drink menu was exceptional. Service was appropriate. Will go back.", "label": "romantic"}
{"text": "I have eaten there 5-10 times. It is consistently excellent. Everything is done well - starters, entrees, desserts. Appetizers make great entrees as well. Terrific wine list. On the pricey side, so I only go when the occasion is accompanied by an expense account.", "label": "business"}
{"text": "I have eaten here several times and enjoyed it greatly. Today’s experience was disappointing. First we needed to wait to be seated at 5:30 PM when the restaurant was fairly empty. Second, the only option of water is $7 per bottle. Tap water is not available. The duck confit was very good. The foie gras is microscopic, about 1 inch square. It is served with a bizarre combination of flavors that tasted like maple syrup and strawberry jelly. For $40 or so it was a major disappointment. The sea bass was delicious. All in all the meal was good, but not worth the $200 for 2 entree and 2 appetizers- with no alcohol or dessert. La Voile on Newbury has more consistently good food at a much lower price point.", "label": "romantic"}
{"text": "DO NOT RUIN YOUR DINNER BY GOING HERE!!!!!! I decided to give this small restaurant another chance and booked for NYE (all my favorite restaurants were already booked by that time, and Deuxave was offering a NYE menu, which I assumed would be better than their normal-priced entrees). When I told my friend about the incident (that I was hoping service and food will be better), he suggested we go to a restaurant with actual good food. I called the restaurant to make sure that we weren't wasting food (if food will go to waste if we did not go), so we can cancel, but was told that yes, food was being prepared already. Katie said we should've seen a note when we made the reservation (cancellations must be at least 48 hours in advance). I tried to explain that I was only asking because maybe the policy wasn't enforced as strictly, but she cut me off several times, repeating that I should have seen the note. Was I arguing about the note itself? NO. When she was done lecturing me, I told her that I was asking because in the past, restaurants did not enforce policy unless it was a party of 6+. She condescendingly told me that the restaurant can have different cancellation policies (yes, obviously), and interrupted me AGAIN when I tried telling her I was only explaining myself for the call in the first place. I told her if she didn't want to listen to me, that is fine. She said OK, and I hung up. Maybe she was going to say \"OK... I'm terribly sorry about the noise in the background, I couldn't hear you, can you please repeat yourself?\" But I doubt it. After I hung up, I was so upset that my friend called to make a complaint. He was explaining the incident to the manager/owner, when he told us that the restaurant was loud with staff surrounding him for a meeting, so he would go down to his office. We repeated our story, when he told us that we've already \"repeated this story five times.\" Weren't we telling him our story again because he had cut us off, telling us that the restaurant is really loud and that he couldn't hear us clearly? And talk about being a hypocrite - he rudely repeated that we were holding him up for a staff meeting multiple times, at times interrupting us while we spoke. Not once did we remind him that he had repeated himself multiple times too. Yes, we could tell from your impatient tone that you want to get off the phone. And during the many times he told us impatiently that he had his entire staff waiting on him, he said sure, this is important too (felt very belittling). He went on to demand what we wanted. We asked him what the policy is when a customer files a complaint. He said that he's the owner, so what we do want? He has such a strict cancellation policy, but nothing for customer service? WOW - you're all about just the $. He claimed that Katie is in a great mood and is very lovely, insinuating that I am not and that I am lying. Throughout our conversation, the owner cut us off, acted impatient with us, and at times, LAUGHED at us. What was so funny about a customer making a complaint? He made us feel very undervalued, continuing to ask what we wanted. I told him that I felt so insulted by Katie that I no longer want to dine there. He said that I'm \"turning this around\" - using this excuse to not pay the cancellation fee. I reminded him that I called to ask if food was being wasted and that I had intended to go (I never even asked if I could cancel my reservation or said my name, so how does he know?). He said that it's \"corporate policy,\" and we intended to come when we made the reservation and there are absolutely no exceptions. Yes, not even if your parents got into a car accident. He said that I must come or pay $150. I asked him if terrible customer service leaving a customer feeling insulted cannot be an exception to the policy-he said no, that we'd \"only see Katie for 10 seconds.\" Why did he demand what we wanted multiple times when he would say \"I already apologized\"? All he could offer was that the it was loud and that Katie must not have heard what I said. I asked him why she didn't ask me to repeat myself, at which point he told me again that he has a full staff waiting for him because of us. Then we hung up. I hope you had a great staff meeting. Please I beg everyone not to come here. There are better alternatives.", "label": "romantic"}
{"text": "We just happened on to this excellent sandwich shop. Walking down the street and asking each other where we wanted to eat, I noticed a very nice looking sandwich that a man had purchased. Seeing this piece of art, I said right here. The staff was very friendly and fast. I ordered the pastrami and corned beef combo. From the first bite to the last this sandwich was delicious. I highly recommend if you are ever in Boston stop here and have lunch.", "label": "family"}
{"text": "First rate. The menu is creative but not overwhelming. The wine list is focused and the by-the-glass options very good...a terrific Barolo. I had the spaghetti (with shrimp) appetizer...the pasta and sauce were so good the shrimp was superfluous. Halibut with black truffles was simple, rich and nicely done. The restaurant suffers from being in an odd location on Copley Square, but definitely worth the trip.", "label": "business"}
{"text": "This was to be my big splurge on a 4 day trip to Boston. Nicely situated off Copely Square, very hip, business like setting. Everyone seemed to be doing business or ending a day of business. After making reservations several weeks in advance of this dinner with a call from the restaurant to my home to confirm my reservation, I was ready for a professional dining experience. We were seated at a table with no option or discussion in what should have been a service alley. After being served drinks and salads a passerby hits my husbands water glass, soaking his shirt and dousing my salad. This was not the woman's fault, who was just trying to leave the restaurant. The distance between our table and the next was less than 3' and this was the main thoroughfare for patrons and servers. Wait staff had to be notify of this calamity and we were made to stand in the middle of the restaurant while they changed linens. They placed us back at this table, my husband is soaking wet, my salad is swimming in water and I am fuming. They serve our main course with no acknowledgement of this disaster and I ask to see the manager. Meanwhile, people continue to hit our table as they try to exit the restaurant. I am now in tears with frustration, my perfect dining experience is ruined. The manager comes, moves us to another table, takes our entrees away and puts a $47.00 veal chop under heat lamps and re - introduces the same chop ten minutes later at a new table. We were compensated by 2 drinks on the house! The food was inedible. To be fair they gave us some asparagus gratis. This was a total disaster! This restaurant was doing a brisk mid-week business and there was no need to squeeze a table in an exit lane. This was a miserable dining experience", "label": "romantic"}
{"text": "Again a great experience! Only been here 3 times but I already feel like family...the food is amazing and the staff are welcoming, real and Aren’t afraid to suggest meals I’d your uncertain and boy are they consistently right, Love this place... just a half block down from the famed Hanover Street but it is my favorite location in the North End. Please don’t leave without trying the Ricotta Pie..you won’t be sorry!", "label": "romantic"}
{"text": "Started with the zucchini flowers appetizer and ended with the grilled scallops. Zucchini was light and the scallops were good. Neither were the best I’ve had. However, both were above average.", "label": "business"}
{"text": "We hosted a group of colleagues for dinner here. The private rooms are beautiful - exactly what we needed. The staff is incredibly helpful, responsive, and kind. The menu offers a large variety - including a large number of gluten free options.", "label": "business"}
{"text": "Wonderful place in the heart of the city. Tried avacado toast and coffee. Went there Sunday morning at 8.30. had to wait 15 minutes for a table.", "label": "family"}
{"text": "There are so many Italian restaurants to choose from on Hanover Street, it always feels a bit like a crap shoot to me. This time, we did some quick online research and found a list of recommended places. We used that list and checked a few places out. Tresca's looked like the place for us - and we were right - it was! The service was prompt and pleasant, the room was empty as we were dining early, but we had a nice view of the street. The Burrata appetizer came with too few crostini and too many tomatoes but was tasty nonetheless. The pasta bolognese was the best I have had outside Bologna and the seafood alfredo pasta was delicious! We also liked the fact that the tables were not all jammed together like in many of the other establishments on the street.We really liked it!", "label": "romantic"}
{"text": "We just came back from dinner at this restaurant and the place is small and cozy which we liked. The food was fine, nothing to write home about. I guess I was expecting something awesome since the North End is supposed to have spectacular Italian food. One thing I did mention to them was the immense heat inside the place. They have an electric fireplace heating up the place, but it was undesirably hot. We had to walk out a few times to get fresh air.", "label": "family"}
{"text": "This is restaurant is a real treat for any celiac. We first had lunch here. It's one of the only restaurants I am aware of - in the entire world - that serves gluten free bread still warm from the oven. It's awesome!! I attach several photos. I also had their gluten free pasta with bolognese sauce. We liked the food and service so much we went back for dinner and I had steak. Everything was very tasty. The service was impeccable. I think my water glass was never empty. Highly recommended, especially if you are avoiding gluten. Worth a visit just for the bread, really.", "label": "romantic"}
{"text": "Long wait. Used outdoor seating . It was a chilly November day, no heaters.. nothing.. It began to drizzle rain. We were about to ask for togo food, but then we were served in the cold rain. The food was average, made worse by the cold. How can you offer outdoor seating in the north without heaters, canopy or wind barriers??", "label": "family"}
{"text": "Great food & great service. The lobster gnocchi is absolutely delicious but sized just right for an appetizer and a dessert. Pair with a white Burgundy and you won't be disappointed.", "label": "business"}
{"text": "Great service, food, ambiance. Oysters re fresh. Some issues though. Cappuccino is substandard. Amaro is served in a wrong glass.", "label": "business"}
{"text": "Was at Grill 23 last night and was extremely disappointed with my meal. I had the wedge salad as a starter which was ok. I ordered the tenderloin steak which I ordered to be cooked to medium +. I was shocked when the plate arrived there were 4 pieces of meat about an inch and a half to two inches in diameter. They looked and tasted like they were reheated; meat was chewy and had little to no taste or seasoning. Thank goodness my colleague ordered the 100 day aged 18 oz. steak and couldn't eat it all. I left 2 of the 4 pieces of my steak and ate the balance of his which was one of the best steaks ever eaten. Creme Brûlée for dessert was also excellent. I still would recommend the restaurant as the service is great, but ask more about the cut of your steak and be prepared to spend a few bucks.", "label": "business"}
{"text": "We had a pleasant quiet dinner. The sole and especially the halibut were very good. Excellent service (Bobby). Not pushy at all. Nice wine list. I hope we can visit again on our next trip to Boston.", "label": "romantic"}
{"text": "The food was amazing. Prices were great. Portions were huge. Service was impeccable. I can't believe how the world has changed in two weeks. I hope the restaurants can survive this pandemic and reopen soon. We had cod, cheese filled ravioli, Caesar salad and the best cheesecake I have ever eaten!", "label": "romantic"}
{"text": "Everything was delicious and huge portions! The kids meals even gave a ton of apples. The milkshake we ordered was amazing and so fun! I ordered a sampler to get a little taste of things. The Mac and cheese anything was good.", "label": "family"}
{"text": "First visit to this location and it was excellent. Make sure to ask for Tray(female) the bartender. She’s professional well versed on the menu and her wines. She preparing for her Advanced Sommelier exam. For these reasons I highly recommend dining here.", "label": "business"}
{"text": "Highly disappointed, to find that place was closed! It was a Sunday, great parking out front, only to find out, they are closed on Sunday's. Nearby bystander stated to me, that they are so busy during the week, that they don't need to be open on Sundays!", "label": "family"}
{"text": "Went here for dinner! Sat at the bar so we didn’t have to wait. Ordered different kinds of burgers. They were all delicious. We also got Parmesan garlic fries. Soooo yummy! If you are visiting Boston, you must try this place out!!", "label": "family"}
{"text": "When we arrived in Boston it was cold and rainy with snow flurries later. Our first meal at Boston Sail Loft was a wonderful welcome to the city. Our server, Taylor, answered all of our questions and made wonderful recommendations. My granddaughter started with the TexMex Nachos and my daughter and I had the cup of Clam Chowder. At Taylor’s recommendation, my daughter and I shared the Seafood Portofino; my granddaughter ordered a Cheeseburger. We loved the clam chowder! I had to try the nachos and they were really good as well. The seafood portofino was outstanding. They did not skimp on the seafood and it tasted amazing.", "label": "family"}
{"text": "Few steps from Hynes center - what a find. Excellent for business dinner. Great sea food, fresh salad, good wine list. Very elegant and even fancy with somehow homely feeling. Recommended.", "label": "business"}
{"text": "Not the cheapest place to eat but the quality of the service and the food made it worth the cost. The restaurant is larger than it looks from the outside but it feels cozy inside. Our server was excellent and the cod and garlic mash was a great choice. Good place for a special occasion.", "label": "business"}
{"text": "Hungry and tired. At tenderloin sliders at the lounge. So good I gobbled it all up. Then added sorbet to slide it all down. So great.", "label": "business"}
{"text": "I read through a lot of menus and ultimately chose Prezza for our North End dinner while on a weekend trip to Boston. Sadly I was disappointed. The food arrived so quickly that I hadn't even had a chance to relax from our walk to the restaurant. It was tasty but not amazing. I had pumpkin ravioli with lobster and my husband had bronzino. The server was fine, but not friendly- just pulling his shift, if that makes sense. I think we enjoyed our dessert of pistachio ice cream more than our entrees!", "label": "romantic"}
{"text": "The ambiance was fantastic. The restaurant was clean and very elegant. The staff was very professional and accommodating. The only downside was the food. It wasn’t what we were expecting. Small portions for the amount it costs. We had better Italian meals in the north end.", "label": "romantic"}
{"text": "Went to Sorellina with a colleague as it was close to Copley Square where we were staying and it was very good indeed. Restaurant was very busy but we still managed to get a table and it is a nice room with an elegant ambience, modern, chic and contemporary. Staff were knowledgeable and helpful and we had no issues with the ordering or the service. Food was very good we had the specials for that night and it was extremely tasty and beautifully presented. My only slight reservation was that it did not live up to the gushing hype of some of the reviews given to it. After reading extensive reviews of this restaurant and a couple of other Italian restaurants in the Back Bay area we went with Sorellina based on the overwhelming number of excellent reviews it had here on TA so in the end the problem may have been that we were looking for just too much from the place. It was very good and we had a fine night and the service was extremely efficient but perhaps we had gone there with too high an expectation.", "label": "business"}
{"text": "This restaurant specializes in Hot Pot. If you haven’t tried Hot Pot, beware…. It is addictive. You choose one or two broths to cook your proteins, veggies, mushrooms, noodles, or whatever you choose for your table. It is a fun experience for everyone. If you don’t want Hot Pot, there is a big selection of Japanese and Chinese dishes that are very well prepared. This is a good choice when visiting the Chinatown area of Boston.", "label": "family"}
{"text": "Love the Atmosphere at this location, great menu selection for lunch. Service is always spectacular and food is great. I highly recommend this for business lunches!", "label": "business"}
{"text": "A magazine review brought us here, and they weren’t wrong. Authentic Italian, huge portions, friendly service. It was a hot summer night, so sitting outside was the best option, but the interior was homey and charming.", "label": "family"}
{"text": "Recently, me and my mom found this restaurant on google and thought it would be just some any old seafood restaurant we’ve seen. We. We’re. All. Wrong. We walk in and it’s insanely busy which we weren’t expecting, people gettin High from IPA beer at the bar, couples having a nice romantic dinner, Children screaming in excitement. It was glorious, Decided to get a cup of the clam chowder what comes out is a literal cup with clam chowder. We also got the calamari and unlike red lobster the squid was so fresh and nice it was still moving. In all honesty it was amazing and 10/10 would go here again. Even if I had to swim across the bay for it", "label": "family"}
{"text": "My guests had a variety of seafood dishes, and they all were highly impressed. Having 5 straight days of seafood in Boston, I took a break and had the filet mignon. When I want raw food, I go to a Japanese restaurant. When I eat a steak, I want it cooked. I find it terribly disappointing that most restaurants - even some well-known steak-specialty places- are only able to cook rare/medium rare steaks; the chefs seem unable to cook steaks competently any longer than that, say medium-well or well-done. Any idiot can throw a slab of meat on the grill for 30 seconds and called it \"cooked to perfection, medium-rare.\" It takes GREAT chefs to cook GREAT steaks at ALL cooking levels, and for this, the Ocean Prime chefs are GREAT chefs. I had the juiciest, most tender, most flavorful medium-well/no pink, no \"butterfly cut\" filet mignon I've ever had in a restaurant. I personally know how to grill a well done steak to perfection: juicy, tender, flavorful and well-done and I do it all the time at home. So few restaurants can do this, however. I will be back to Ocean Prime when I'm in Boston for the steaks. Let the others have their excellent oysters and calamari and other fish - this place knows how to cook a steak any at level!", "label": "business"}
{"text": "I’ve been to Davio’s a few times but this may be my last time. Although my entree was very tasty, the value of my meal was sub-par. My husband and I ordered cod for our entree. When it arrived, the filet was the size of a “half” of deck of cards. Yes, 2 inches. It looked like an appetizer. I was shocked. It cost over $30.00 for that mini piece of fish. We left hungry and very disappointed. They should be ashamed of themselves serving such a small piece of fish. In addition to that, the waiter was also very slow and not attentive. Not a great experience. Too many good places to eat in the Northshore to settle. Not returning in the near future.", "label": "romantic"}
{"text": "I was looking forward to trying this vaunted restaurant. It was out 4th wedding anniversary so I thought, let’s go somewhere special. For all the reputation and fanfare, it just wasn’t that great. Decor The decor is sleek with large glass pictures of Tuscan scenes hanging in the middle of the room and low, upholstered furniture in neutral tones. Throw pillows and cushions soften the edges. Dim lighting (almost impossible to see the menu) is provided by large metal chandeliers capped by shades that are knocked in all directions giving a somewhat disheveled effect. Entrance The hosts are pleasant and readily offer to take your coat. Notwithstanding all the softened tones, throw pillows, fabric furniture and low lighting, the noise level was quite loud. Service I had just sat down and the waiter was upon me asking if I would like a cocktail. I hadn’t had time to even look at the beverage menu. He kept coming back every few minutes asking “Have you decided yet on a drink?” It was a tad pushy. My husband arrived and we wanted to study the wine list (which is very good including half bottle formats). The waiter kept coming up and asking if we were ready. I can understand the need for a table but it was later in the evening midweek and there were still plenty of open seats. We selected a very good Margaux and let him go get it to give us a few minutes to look at the menu in peace. Menu offerings The menu is pretty standard- there is nothing overly ambitious or exciting. They feature the usual NY strip with gorgonzola, Faroe island salmon, duck breast, red wine filet, Cornish game hen and halibut . It didn’t feel French or continental at all. It was what you would expect to see of a hotel menu. Because it was late, we only ordered entrees. The waiter coughed in a bit of displeasure asking didn’t we want an appetizer? Apparently, we weren’t following his desired format for things. We declined noting it was pretty late. Inattention after food is served The food arrived. We cut into the meat-my husband’s was done perfectly. He enjoyed it. The red wine sauce nicely coated the steak and there was an a abundance of horse radish mashed potatoes. The asparagus was perfectly done and pleasantly flavored. My first cut of steak was fine. The waiter departed. We did not see him for the remainder of the meal. Nobody came by to fill water glasses or check on us. We refilled our wine from the decanter ourselves. Upon second cut, I found the filet was overdone. It was tough. I stopped eating. My husband gave me some of his. I was hoping someone would stop back but they never did. I tried to signal wait staff in other parts of the dining room to no avail. When out server finally returned (25 minutes later), I told him about the steak and showed him. He kindly offered another steak but it was so late at this point, we declined. He also very kindly did remove it from our bill. He apologized for leaving us so long and said he should have been checking on us more frequently. He was right about that. Dessert Best part of the meal. The molten chocolate was some of the best I have ever had- evenly and smoothly melted with no thick clumps. It went beautifully with the wine. Overall For the money we spent, I would say go elsewhere. The food was average at best. There are far more creative venues out there with more palate pleasing offerings. Service was uneven and felt pushy in terms of trying to add additional items to the order. We went from hyper attention to benign neglect. They did the right things in the end but it was sad that our anniversary dinner meant sharing a few bites of my husband’s entree and living off bread.", "label": "romantic"}
{"text": "Really outstanding place in the Back Bay Copley neighborhood. Great (albeit pricey) wine list, as one might expect of a restaurant with ambitions like Sorellina. We thoroughly enjoyed our meal. My wife and I still talk about the polpo appetizer (grilled octopus over squid ink couscous) - it’s as close to a perfect app as we’ve ever had. If you’re looking for fine Italian dining in Copley and don’t mind paying for quality, you will not be disappointed. Can’t wait to return next time we’re in Copley.", "label": "romantic"}
{"text": "Went on 9/29 (my wife’s birthday). Tried to reserve the balcony table (table 77) 2 months out but was told it was reserved for the entire season. We got a table upstairs, it was somewhat intimate (table to the left and right of us). We got the seafood Alfredo (it was delicious) and the chefs special lasagna (2.5 stars, left a little to be desired, maybe more sauce and cheese) I stated it was my wife’s birthday in the reservation , they bought out donut holes and ice cream. Very nice gesture. We would recommend this restaurant.", "label": "romantic"}
{"text": "Wonderful restaurant, with beautiful, imaginative cuisine. The room is lovely but a little loud. If I were going with a group, I'd try to reserve the private space. It's very conveniently located and within walking distance of most of the major hotels. A great, if expensive, addition to the Boston dining scene.", "label": "business"}
{"text": "My husband and I visited La Summa during our trip to Boston this week. It was a weeknight and we didn’t have a reservation, but it got pretty crowded. If you go on a weekend, you should probably make one. We started with the salad for two, which was probably big enough for three. It was fresh and the flavors of the Gorgonzola and the berry vinaigrette were perfect together. My husband had the Pappardelle Alfredo and said it was sensational. I had the Pollo Limone, which was delicious- just the right amount of lemon and wine. For dessert, the tartufo and cannoli were great! They don’t have a bar, but have a nice selection of wines, sangria, and some cocktails. Our server, Destiny, and hostess, Julia, went above and beyond to make us feel welcome. We will definitely return the next time we’re in Boston!", "label": "romantic"}
{"text": "Arrived on a Friday night at 5:20- there were 7 of us and we got lucky with a very comfortable table towards the back of the restaurant. From beginning to end our experience was delightful. The atmosphere was just perfect to have a conversation without having to scream across the table, and the ambiance was quiet comfortable. Full liquor menu and I had a espresso martini which was very tasty. Our server was extremely attentive and took care of every question about the menu and made some perfect recommendations. He bagged up our doggie bags ( which we had 3 since the portions are very large) and bagged them separately since family was going to different places. Can’t recommend this restaurant anymore that a 5, but would definitely come back and recommend it to anyone visiting the North End.", "label": "family"}
{"text": "A fabulous meal and memorable experience for our family of 5. Make reservations. We were warmly welcomed and everything exceeded our expectations even with the great reviews on Trip Advisor. Loved the family atmosphere and the food was excellent and plentiful. When we are back in the Boston area, Mario's has been added to our must do list. We loved your cooking Ursula!", "label": "family"}
{"text": "We had a wonderful outdoor meal on a busy Friday night. Everything is homemade on the premises. The red sauce is amazing. We also loved the cannoli. The prices are so reasonable. The waitstaff is friendly and attentive. One of the best parts is that the restaurant is not on Hanover Street so we could watch the world go by but not be bothered by crowds. We look forward to going back!", "label": "family"}
{"text": "Al Dente has a great menu with large portions. Our waitress, Lisa, was very knowledgeable on the menu and recommended some tasty dishes. With social distancing still in place, it was really nice getting to eat outside on a night with beautiful weather.", "label": "family"}
{"text": "We came to this restaurant because of the good reviews that we saw online. We made a reservation and upon arriving we were seated promptly. However it took a very long time for us to get any service and we had to keep waving to our server to come to us so that we can order. Finally we ordered our food and had our appetizers served. After that, as our server was clearing the appetizers he spilled the sauce on my suit jacket and shirt, and he apologized and brought a cleaning liquid to me so that I can clean my clothes. The manager also stopped by to give us his calling card just in case I wanted my suit to be dry cleaned. We thought that was the end of the story, but as our main courses were brought out it turns out that our server had taken my main course order wrong. I ordered the rack of lamb but was served a duck dish. So they took away the wrong order and had to make my correct order again in the kitchen which took 20 minutes. The manager stopped by again to apologize and offered to take back my date’s dinner to the kitchen while we wait for my main course. However my date had to start eating her dinner because it was getting late and she was starving. By the time my dinner was served she was done with hers. To compensate for all the things that happened, the restaurant gave us a free dessert, which was a nice gesture but we really didn’t want any dessert at this point. To be fair, the food was good. My rack of lamb was good, but my date felt that her dover sole dinner was good but overpriced at $60. The ambiance was also good but the entire experience was ruined by the terrible service.", "label": "romantic"}
{"text": "If you are looking for a great Italian meal, served by genuine and caring staff; and prepared with the highest standards - then you're at the right place. Davio's in Foxborough was one of the best Italian restaurants I have been to. They have an extensive wine list and their menu options are outstanding.", "label": "business"}
{"text": "Elegant, chic, impeccable service and the food is fabulous. Greeted warmly by the manager host, Christian. From the minute we walked in, it felt like we were about to enjoy a wonderful dinner and evening. Edwin served us our cocktails with minimal wait time. Our server, Louis is extraordinary. He is so patient, explained the menu selections thoroughly and we never felt rushed. The carpaccio appetizer was finely prepared with fresh herbs and the cod and salmon dishes were delicious. I’m so fussy about the temperature of my food and very happy the meals were served steaming hot. Javier assisted Louis and even though the restaurant was nearly full, we felt like they were our private servers. The wine list was great, as well as the desert selection. Manager Yannick shared a few words with us about the history of Mistral. Perfect dinner and evening. Grazie Mille", "label": "romantic"}
{"text": "Our cocktails - a Cosmo and an In Fashion (take on an old fashion) - were fantastic. We also enjoyed the house made chips which were complementary. We ordered the Tuna Tartare, very good, and the Lamb Lollipops which were beyond delicious. Voula our server was attentive, friendly and personable. It was a wonderful experiene. We will return.", "label": "romantic"}
{"text": "This is still an establishment you can count on for a top notch dining experience. The service as well as the food were spot on and my client was extremely pleased. Restaurant week provided a 38 dollar three course dining experience which was both affordable and fantastic. Would return in a heartbeat.", "label": "business"}
{"text": "How can we come back to Boston’s North End and not go to La Summa?!? Two years ago we visited and thoroughly enjoyed our experience so, of course, we went back. We still had our two favorite appetizers (arancini and stuffed artichoke). I loved their fresh pasta the last time but I wanted to try the Pollo Limone. But I did have it served over the fresh pasta. My husband had the Pollo Speciale. We were both pleased and shared a piece of ricotta pie! There are so many places in the North End but this one is worth revisiting!!", "label": "romantic"}
{"text": "We visited Tresca on a warm spring evening while walking through the North End. We had a drink and dinner. First of all the staff here are very friendly and attentive. We ordered the Veal Parmigiana and the Eggplant Parmigiana and both were excellent. Truly 5 Star all around. Done just right and with an excellent sauce. The pasta was done just right and very good. Good enough to finish and sometimes I don’t always feel the need but it was too good to let it go. I can’t say enough about Tresca.", "label": "romantic"}
{"text": "We made reservation here end of July. Our server was professional and extremely knowledgeable helped us make decisions and creatively coordinated our experience (I want to say his name was Robert but I’m unsure ) We started with a wonderful bottle of wine. Their wine list was so impressive I spent 20 minutes just looking through it. We started with the fig appetizer and that was exquisite. We decided we would try the ravioli di uovo for a second appetizer and loved the unique taste. My wife had the scallops which were done perfectly, seared nicely and very very fresh. I wanted something different so the chef made me a combination of two plates and it was amazing. More seafood then one could imagine and all cooked to perfection. They went over the top on my plate but it was about making their customer happy and they succeeded. Thank you Prezza for an incredible meal.", "label": "romantic"}
{"text": "The food at Ocean Prime is just fine, but not at these prices. I travel for a living and eat at great, good and lousy restaurants all the time (including the upscale chains, like Capital Grill, Morton’s, Fleming’s etc). I have been to Ocean Prime several times and I would describe the food as ‘ok’. However, at these prices (and pretensions) it should be great. The halibut—on a very odd bed of mashed and fingerling potatoes, green beans, oranges and tomatoes—was dry and over cooked! At $47. Unless a client insists on this spot, avoid at all costs.", "label": "business"}
{"text": "Two of my colleagues and I went to Boston for business. The “foodie” of the bunch found Mama Maria had excellent reviews so we went to check it out. It did NOT let us down! Our dinner was SO good that when we got stuck in Boston for an extra night (due to flight cancellations due to weather back home), we went back to Mama Maria for a second dinner in three days!! Both servers made excellent wine recommendations to complement our meals and the meals were delicious!! The menu changes daily but thankfully the pasta con sugo was available both nights. Yep! I ate it both meals!!! My colleagues had the ossobuco and the rabbit pasta and we shared bites and every dish was spot-on!! Mama Maria is worth the price and their wine list is extensive (various price points so be prepared!). Considering our “foodie” companion who loves to try to new places was more than happy to go a second time, Mama Maria’s is a BIG RECOMMEND restaurant.", "label": "business"}
{"text": "We stumbled upon this restaurant looking for a place to eat outside. We had scallops for appetizer, Monk fish and halibut for main course. Everything was very delicious. The food was expensive but delicious and I would definitely go back.", "label": "romantic"}
{"text": "My expectations were met and far exceeded - from the server to the meal. The ONLY issue or complaint I have was the cold borderline rude greeting from the four people all huddled around the host stand. No one smiled, of the four people standing there, one woman (perhaps a manager) rudely inquired as to why I would possibly stand at a host stand. Never a smile, until a younger female showed me and my guest to our table, and while she smiled at one point she appeared lost as if she forgot what table we were headed to. Honestly I was furious and in a terrible mood from the first interaction with the hosting gang however the server turned all that around and rather quickly!! He was funny, charming, well educated on the menu (both food and wine) and his interactions were pleasant and enjoyable. The French Onion soup while it was cheesy and delicious it was just warm but again the flavors helped makeup for it - then again the two of us ate the entire thing so I guess it wasn't all that bad. The crazy berry and goat cheese salad was heavenly - I had asked my companion for a bite or two as we order and the server had the salad split into two plates which was awesome. Both of our main courses were insanely delicious - we each had the filet prepared differently but each one cooked perfectly. The creamy garlic spinach was unreal and I hate spinach and I couldn't get enough of it. The scalloped potatoes were awesome and SCOLDING hot so be ware! I will go back - I'll just avoid the speaking to the hosting staff.", "label": "romantic"}
{"text": "First time in Boston and searched for a great Italian meal and found Mamma Maria. Fortunately, we were able to get in without a reservation (Monday evening). The bread, olives, and pesto dipping oil was a great start to the meal. The Autumn Salad was wonderful and the Pasta Con Sugo was fantastic. Thick delicious pasta noodles with a wonderful sauce. We shared all of that so we could order two desserts! One was the Apple Tart and the other Plum Cobbler. Both were astounding. The tart was melt in my mouth good. The cobbler was surprisingly complex, with the tartness of the plums being a nice contrast with the overall sweetness of a cobbler and ice cream. Note in the pics that they split our salad and pasta for us, so the pics show a half portion of the each.", "label": "romantic"}
{"text": "Recommended by friends who had visited Boston months ago and loved the food and service, this place did not disappoint. Our waiter, Raphael, was excellent and his wine suggestion was perfect with our meals. The homemade squid ink pasta with clams & crab was simply amazing. My husband had the pasta with meat sauce and it too was delicious. Locally sourced ingredients and home made pasta with perfectly crafted sauces. I’d give it 6 stars if I could! Also, we shared an arugula salad and tiramisu. Both were quite tasty and ideal ways to start and end the meal. We will go back to Mamma Maria’s every time we’re in Boston!", "label": "romantic"}
{"text": "Went away for a couples quick getaway into Boston. Ambiance is nice, we sat outside in somewhat of a misty kinda night but they have gas heaters. Service was a little slow to get our first drink but we do recognize that with additional seating, comes greater distance that the servers have to cover. I ordered the scallops with side of broccoli rabe and my husband got the salmon with whipped potatoes. The scallops were cooked perfect with these tiny beads of Yukon potato that made the dish very delightful. The Broccoli rabe left something to be desired and didn’t enjoy it as a side dish, ended up only eating a little bit. We finished off diner with some tiramisu that was very good. The mascarpone was very smooth and velvety, with a bit gelatinish like feel. The dessert has the lady finger soaked in expresso inside with the mascarpone wrapping it. My husband asked for a green martini and they made it unlike anywhere we’ve had. Very smooth, a little hint of sweet, a dash of an herby and fruity feel, topped with a soaked cherry. The cherries they garnish the drink with that resembles Queen Anne’s chocolate cherries.", "label": "romantic"}
{"text": "I SERIOUSLY. Did not. Want to leave. We split every thing as usual. I do not have one single complaint. Absolutely none. Except that I didn't want to stop eating. Lol Had the mushroom risotto, Gnocchi Bolognese, Bucatini and the Halibut. Phenomenal. Make a reservation! It's worth it I shall return to you my dear Prezza! I will return! Thank you for a wonderful experience! Bravo!", "label": "romantic"}
{"text": "Visited twice as the first time thought to be an anomaly. Unfortunately the second visit was worse. This restaurant is great for large groups of 6 or more. It is not a good place for anyone under that group size. First warning: do not sit upstairs; staff are overworked and will ignore you. In both of my visits I had the Caesar salad; the first time it was memorable; the second they chopped up so many anchovies it was inedible. Tried the steak tartar that had so much salt that even the waiter said it was disgusting. He took it off the bill immediately. My second visit tried the pot roast, which tasted like it came out of the microwave. It was so hot I had to ask for it to be put in the freezer! The waitress did not even show up, until after the bill was paid, and then questioned why I did not eat the meal. Overall a bad experience and certainly a place to steer clear of.", "label": "business"}
{"text": "Seriously, do the venison, very nice, very gamey. Wait staff were awesome, great selection of dishes, wines, etc. Vegetables not great, must say, mostly over-cooked. That aside, very nice.", "label": "business"}
{"text": "Lovely Italian restaurant in the North End. Beautiful restaurant with a home-y feel. The menu has some interesting items/twists to the traditional, but everything is really good. Service is also really great! Don't be surprised to have your napkin refilled and waiting on you after a trip to the restroom!", "label": "business"}
{"text": "I booked a table for 4, with my wife and another couple. Welcome was excellent, our coats were checked. Our waiter was very nice. Steaks were beautifully cooked, but lacking a little bit of salt. Sides are massive and can be shared. Of course, it’s Morton, so not really cheap, but very good quality.", "label": "business"}
{"text": "Since our previous designation did not pan out for us, we crossed the street in Boston's happening Chinatown & came to Q's. While we waited for our casual meal of appetizers, we were educated on the world of Hot Pot. I simply 'feed' off being culturally educated while partaking in good Asian food. Our table had its own personal induction cook top, which was a 1st for me to see. HotPot 101; * Server turns on the cook top & lets it heat up. * Your table is covered with raw Vegetables, Meats, Seasonings, Spices, Noodles, Rice, & your preferred Sauces. * Server brings out the Hot Pot, which has two sections for different broths of your choosing. * Let the Hot Pot creation & cooking begin. What a fun & interactive DIY concept.  We saw some guests using their ladles to drink the broth & to note, there are pre-made Hot Pot selections like the Supreme Seafood. Q's interior was very welcoming with the colorful décor, & has a Sushi Bar that also offers individual cook tops. Thank you to our generous & friendly Server David, for not only taking good care of us yet sharing enlightening Hot Pot insight along the way.", "label": "family"}
{"text": "Though we have had great meals in Boston, this was not one of them. This restaurant was recommended on several sites, but we were a bit disappointed. Though the prices were fare, the food was ok. We ordered the lobster omelette, which according to the waitress was made with 5-6 eggs, it was no larger than a regular omelette w/3 eggs. Also we were encouraged to substitute our toast for French toast, yet not told it was an additional $5.00. We also found one particular waitress, a brunette to be rude. All in all, I would recommend Modern Bakery for breakfast (they actually have a breakfast menu!) and are very kind to their patrons!", "label": "family"}
{"text": "The food was, simply put, wonderful. My brother said it was the best meal he's ever had. My family all order a different dish and we all loved them. I had the evening special Chicken and Shrimp with spinach tortellini. My husband had the Pollo Marsala and couldn't believe how great the sauce was. The wait staff was incredibly attentive. We called and made reservations when they opened and got a table for 6 with no problem. We walked past several restaurants with lines out the door... Skip those and go to wonderful La Summma.", "label": "family"}
{"text": "The Best Sandwiches in the world!!! Very fresh an good quality ingredients. Everybody gives you a big smile and an excellent attention. It is a MUST if you go to BOSTON!!!!", "label": "family"}
{"text": "We have dined previously at Mistral. We liked the old menu, and pricing, better. Excellent professional staff. It’s getting too expensive in my view.", "label": "business"}
{"text": "I took a work colleague to Sorellina. Both of us had appetizers, a pasta course, an entree, and we split a bottle of wine. The total bill came to $450. The experience was just OK, which I don't expect for this amount of money. My appetizer was an octopus dish, which was the highlight of the meal. It was good. Not stellar, but good. Next I had a mushroom pasta dish. Again, good not stellar, although it was on the heavy side. Last, I had veal saltimbocca. The veal seemed to have been left under a heat lamp. It was dry and tasted like pork. The wine menu was, even by Boston standards, over priced. Normally, at a place like this, you expect impeccable service. This was not the case. I was seated at table without a napkin. The waiter did not notice. The waiter did a horrible job anticipating our needs. Sorellina is loud. So much so, that I had problems hearing my guest. This is corporate restaurant. The identity of lis tied to the corporation, not to the artistic soul of a particular chef. Sometimes, this is fine, but for this experience the corporate feel went overboard.", "label": "business"}
{"text": "Excellent food. They make their own bread!! Tried the cinnamon raisin toast which was amazing. Joined the waiting list right before we walked over about a 7 minute walk. We were seated immediately. Quick friendly service. Cool place. The omelette was amazing with spinach mushrooms garlic and asparagus. Had it with egg whites. Lots of options and you could eat there for two weeks straight and not get bored. Would definitely visit again when travels bring me to Boston.", "label": "family"}
{"text": "Excellent! The hostess, bar staff, and waitress were super nice. There is indoor and outdoor seating most with a nice view of the water. My lobster roll was amazingly large and delicious. Well worth the money. Would definitely go again.", "label": "family"}
{"text": "I visited with family after reading the review in tripadvisor. This was the good choice! Hotpot is very good. Need to book the table in advance.", "label": "family"}
{"text": "This eatery was visited on a Monday, as I am not patient enough to wait for 45 minutes-1 hour. I also didn't want to arrive by 8 am, since it is vacation after all.", "label": "family"}
{"text": "Found this on TA. We were staying at the Logan Hilton overnight due to early flight and we stopped in on a Monday. Not very business maybe 3 other tables, one with some firemen who were swearing a little too much for me. Also a local priest came in for dinner. Ursula and a waitress very attentive . Ordered the calamari and cocktails to start. Cocktails and bread came out quickly . Ordered the Gamberi Alla Antonio and the Veal Limone. Dishes were excellent though took a little bit to come out considering not busy. For East Boston , I thought was excellent choice.", "label": "family"}
{"text": "We checked into a hotel late in the day and wanted something nearby. Based on a prior experience we returned to Davio’s and were not disappointed. The Negroni was perfect, the wine list by the glass had just what we wanted. The menu is varied and extensive and everything we ordered was well prepared. Our waiter was attentive but not obsequious. The dining room is a little noisy but not impossible to carry on a conversation.", "label": "romantic"}
{"text": "We had never experienced a hot pot meal before and had lots of questions but our server was extremely patient and informative in helping us understand how it worked and what we should order. Overall, it was a unique, fun and tasty meal for us with our kids, albeit a little messy. As it got later, a line started forming for people to be seated and our server disappeared. We never got drinks that we ordered and it took quite a while to get our check, but we’d still go again when back in town.", "label": "family"}
{"text": "Simplicity never tasted so good. From the greeting at the door to saying thank you and goodbye, everything was welcoming and delicious. The staff were all wonderful. The food was as good we hoped it would be. Best gravy! The manicotti was fantastic as were all our dinners.", "label": "romantic"}
{"text": "Truly fabulous meal enjoyed with nine other colleagues on a Tuesday night. The setting is sublime – wonderful 19th century home with different dining rooms on both levels, offering variety, intimacy, and style. Service was extremely polished yet not too snooty for picture taking. I saw some young couples enjoying romantic meals and business teams like ours having jovial R&R. Food was nothing short of spectacular. The tartare of yellowfin tuna in a Venetian style with fresh cucumber, sliced radish, and extra virgin olive oil was melted in my mouth like butter. My Caesar salad was impeccable, too. The star of the evening was my second appetizer, the veal carpaccio with shaved summer truffles -- likely the best carpaccio of any sort I’ve eaten in my life. As a close runner-up, my main course, the veal shank osso buco, was prepared in the classic style with saffron risotto Milanese and an immense amount of flavor. This place has charm, quality, and reasonableness all wrapped into one. Strong five stars from Cherry Wonderdog!", "label": "business"}
{"text": "Hard to categorize this restaurant. Eclectic menu with modern takes on dishes with many forms of protein. But frankly nothing was memorable. The service was solid. The wine list is more than adequate. But the meal was pedestrian and expensive because it's in the North End. At the end of it all, I'd be hard pressed to return for food that's actually available in the suburbs at downtown prices. I had a spicy seafood pasta that was fine. Garlic toast was fine. Others had a Branzino that we could find in any city, tasty and not overcooked.", "label": "romantic"}
{"text": "The service is always excellent and food top notch. This Capital Grille has a big picture of Red Auerbach, so everything else is all good! You get consistency regardless of location and I found that here as well. Very good food.", "label": "business"}
{"text": "I visited last Saturday, March 27th and I tried the special of the night! Prime rib on top of a bed of asparagus and with a white sauce! It was delicious and service was great! Would go back again!", "label": "romantic"}
{"text": "Great food, nice ambiance, good service; I can definitely see why most people like this place. But it's expensive, so I went in with pretty high expectations. The service was okay. The waitstaff was friendly and knowledgeable. However, there were a few mistakes, and I wouldn't quite say they were overly attentive. The food was good, but some of the items seemed overpriced like the $32 truffle macaroni appetizer. My halibut was fine, slightly blander than I expected, but I was surprised to find the plate swimming with shrimp/shellfish since I didn't remember seeing that in the description on the menu. Many probably would have considered that a bonus, but I don't eat shellfish. With dessert (the warm chocolate torte was fabulous), my decaf coffee arrived cold, so I had to send it back for a new one. And while it could just have been a coincidence, I was literally awake for 5 hours last night staring at the ceiling wondering if they remembered that I had ordered a decaf. Perhaps I am being petty; everyone I was with seemed to have a good time overall. But my personal experience at Mistral was less than stellar.", "label": "business"}
{"text": "We were in town for the Seafood Expo and had a table of 8. From the beginning until the end of our meal it was nothing short of perfection. Our server was right on point and the food delicious! BUT, the show stopper was the Apple Tort...Delicious Flaky Layers of Greatness! Thanks for a wonderful dining experience...Your friends from Louisiana", "label": "business"}
{"text": "Classy location though it may get too noisy during peak times. Menu and wine list is outstanding. Needless to say the Steak is King and it is top notch. Service was at the level that you can expect from a place in this league. Pricey of course but it was worth it!", "label": "business"}
{"text": "ask for waiter Stan from Ireland, best I have ever had. food is all outstanding, try the risotto, to die for. All seafood is fresh, sides were unbelievable, try the tater tots and jalepeno potatoes, both handmade.", "label": "business"}
{"text": "This restaurant offers upscale Italian dining in a great location. Very chic decor, food was very good, great appetizers, good choice of pasta and main dishes. Donut medley dessert was awesome. Good drinks menu too. Can’t fault it at all.", "label": "romantic"}
{"text": "This place is awesome! My husband and I went there for restaurant week. We figured, let's give it a try, if we don't like it not a great loss. Well, this has got to be one of my favorite French places to dine! Where shall I start? The outdoor seating area was almost filled when we arrived at 6:30pm. This was a good sign. The diners were trendy, attractive people, another plus. The host greeted us with the most adorable French accent, so far so good. We had a wonderful seat in the back room next to the fire place. Very charming! Our waiter, Adam, was super helpful and just plain excellent! He recommended a wine, Chateau Simard St. Emilion to go with our duck. Fabulous recommendation! My starter was the foie gras n the husband had mussels. Adams gave me a taste of the 2010 Haut Charmes Sauternes. Wow!! I think I'm in LOVE!! The whole experience was just wonderful. I felt transported to a lovely restaurant in Paris! This place is magical and I cant wait to go back there and try a whole sea bass and some more wine!! Great place if you want excellent service and 5 star food!!", "label": "romantic"}
{"text": "In Boston on biz with a group of five. Someone at the hotel recommended this place. We had a very arrogant waiter who prompty set a menu on the table, which turned over and spilled glass of water on one of our party. The waiter then picked the glass and the ice up off the floor and refilled it with water!!! The food was average AT BEST and the quality was not in line with the pricing. Overall a poor dining experience. We will NEVER return and will not recommend it to anyone.", "label": "business"}
{"text": "We were in Boston for the weekend and found Tresca. It was a quick and easy walk from out hotel near the market. The atmosphere was amazing and the food was top notch! We will return anytime we are in town.", "label": "romantic"}
{"text": "I made a reservation Saturday night for 5 people at 9:30. As I was driving there from my hotel I received a phone call from the host at 9:15 telling me my table was ready. I told him we were on our way and according to the GPS we would arrive by 9:15. When I arrived at my estimated time of 9:15 and checked in the man at the door told me he had given my table away. He made no attempt to apologize by offering us a drink while we waited. He made us wait outside no less! Well I'm sure losing 5 people for dinner is not a big deal to such a busy restaurant, but as time goes on and more great restaurants pop up, customer service will be a big deal!", "label": "family"}
{"text": "So the prices might be higher but you definitely get what you pay for. Great wine list and amazing food choices! I only found their version of tiramisu weak. Thomas was an outstanding waiter. Cant wait to go back! Thanks for a wonderful evening.", "label": "business"}
{"text": "We visited during the dine out boston week so we had the set menu and chose the salad, filet mignon and my partner chose to upgrade to the New York steak along with creamed spinach and mash potato followed by cheesecake and flourless chocolate cake. The food was absolutely incredible, all extremely tasty, melt in your mouth and we polished off every plate. They have a good selection of cocktails and wines that aren't overly priced which I was half expecting in a place like this so that was a lovely surprise. The only reason we are giving this a 4 star review is because the service seriously lacked. We were told to wait at the front with all of the other customers for just over 5 mins (fine, it's not an issue), then over the next 20 mins we meet out server and get offered water, then cocktails then bread and then take your order all in separate interactions which was just odd and felt as if they were lengthening the beginning for some reason. Within 5 mins of ordering the salad, it was infront of us which is fine but just odd as they were going so slow and then completely changed the pace. Our steaks followed promptly and although it was delicious no one checked in on us, took over 10 minutes to take my empty plate and no follow up asking how it was. Whilst eating our dessert our server plonked the cheque down whilst dashing off somewhere else, we didn't ask for it and felt very bizarre to be in the middle of eating with no interaction to just have our bill presented to us. Overall the food was incredible and melt in your mouth but the service had an odd pace, lack of interaction and friendliness from the moment you walk in with the hostess to your waiter service. If only they had taken the time to interact it would be a completely different service - maybe they saw two people on their set menu and thought it's not worth their time to serve properly which is a shame.", "label": "romantic"}
{"text": "An outstanding menu with an excellent choice of seafood characterizes this downtown Boston restaurant. An attractive venue, the appetizers are exceptional and the wine list is outstanding. This is an upscale venue and a gem in downtown Atlanta.", "label": "business"}
{"text": "The food is delicious. Decor is modern. The staff is attentive. Very loud restaurant. I do not recommend for a romantic dinner. I had dinner on a Saturday evening. The restaurant had a party atmosphere with live music. Great for a group social dinner gathering.", "label": "business"}
{"text": "I was disappointed. I had the polenta as an appetizer and it was basically tasteless. The steak had a tremendous amount of fat. It was good but less than expected. The property and location was fabulous, but I went there to eat. I won’t be back.", "label": "business"}
{"text": "I have been raving about the food here and finally got to enjoy it with my family today. Was worried about ordering take out and was wonderfully surprised. EVERYONE enjoyed their food and we are anxious to go again and try more. The north end omelette as a scramble is my personal favorite. I live in NH and it is worth the drive. A must try!!", "label": "family"}
{"text": "Great place for a meal but make sure you have a reservation. Small restaurant but excellent food. Angela was our waitress and she was the best...felt like she was family by the time we left.", "label": "family"}
{"text": "The Friendly Toast had excellent food, fast service, excellent choice on menu. Definitely would recommend eating here. The prices are right in line with any other place you would eat these day's, but you get large portions.", "label": "family"}
{"text": "Mistral is an all-round solid experience. The hostesses are welcoming, the wait staff highly attentive and professional, and the food superb. The portions are enormous and every dish was flavorful and well-executed. The foie gras perched on a brioche and embellished with bits of duck confit was especially memorable. There's a great wine list as well.", "label": "business"}
{"text": "Best clam chowder ever! I have eaten clam chowder from San Francisco to Maine. Never had any better clam chowder than here. Staff and atmosphere great but chowder GREAT!", "label": "family"}
{"text": "I had birthday dinner at La Summa Cucina and it was a wonderful experience. We had a travel delay and arrived an hour past our reservation. I called to let them know we would be late and they graciously accomodated us. I was so happy. This is a small, out of the way place where you can relax and enjoy a superior meal. We had stuffed mushrooms to start followed by one of their specials. The food was deliciously prepared and the house wine was really good. The service was very special and made you feel like you were being taken care of. We finished with the chocolate cake and the server sang 'Happy Birthday'. I didn't catch her name but she is one of the best parts of dining at La Summa. I highly recommend this restaurant and wish I lived close by so I could be a regular. Don't miss this gem off the beaten path!", "label": "family"}
{"text": "We had the best night, dinner, food quality and most hospital service in our conference week in Boston, senior medical doctors. We were put off by a next door legal Harborside restaurant most unprofessional ever seen, instead we had personalised service by manager service with best steaks and desserts ever giving us best night there, thanks again to lovely waitress sorry cant recall name and fantastic manager, who praised us at the end saying \" this other restauarnt indeed lost a hell of a client group paying 2000 dollars for 15 doctors\"", "label": "business"}
{"text": "We went there for my wife's birthday, and had a very nice experience. The service from the hostess, and all the staff was amazing. They were very attentive and friendly and made you feel like you were in there home. Sharon, the bartender made us excellent expresso martinis, very tasty and nice presentation. I had veal parmigiano and it was very good, maybe the best I had, I usually get the veal chop, but they did not have any. My wife had the shrimp and broccoli, it was good, but could have used more seasonings, like more garlic and salt and pepper which she added. Great experience, I will go back again.", "label": "romantic"}
{"text": "I was out with a client and ended up here after recommendation of the concierge of the hotel I stayed. It’s nicely decorated great atmosphere however the music was so loud. Not the background music you expect from such a restaurant. We were very friendly welcomed by staff and guided to our table. Nicely made up with a linen napkin. The waiter was nice very patient and did some good recommendations although why if you ask for a recommendation for wine does he come up with the most expensive instead of better alterations with a more modest price . I chose the tuna with avocado as a starter it was delicious and as main course the scallops which were also very good. Finished with an espresso which was more like a strong coffee definitely not an espresso as the Italians have meant it . I have to come back for a 2nd chance. If the music is still that loud i will turn around. It’s a pity as I really like the atmosphere", "label": "business"}
{"text": "Jillian, the concierge at Seaport Hotel in Boston recommended Morton's for a \"special dinner\". We walked across the street in single digit, blustery weather and were absolutely delighted with our meals and service. Shakib, a mature 22 year old waiter, was outstanding. He was professional and very attentive to our requests and flawless in his recommendations. In fact, everything was so good that I invited a customer to to join me at Morton's for dinner the next night. Again, we were not disappointed. Tristan was our waitress and her service was also exceptional! This restaurant made a huge impact on my guest and needless to say, I was more than happy! We enjoyed delicious steaks, seafood, and amazing desserts. Highly recommended!", "label": "business"}
{"text": "Place was excellent. Food and service was very good. Good portions. Would definitely go back. Small inside like most places in north end.", "label": "family"}
{"text": "As a family of 4 we like variety and we got it at the Boston Burger company. Found it on TripAdvisor as we were in the area and in need of food. I ordered chicken while the men of the house had beef with a side of baked beans. Every meal was good and i highly recommend coming. The service was great as well!!", "label": "family"}
{"text": "This was my Forst visit and I was blown away by the incredible dishes. Our waiter pointed us in the right direction by recommending the sea bass and truffle starter, the tartar, and the octopus. All were terrific. The mains were also very good...especially the salt crusted branzino. I highly recommend.", "label": "business"}
{"text": "Three out of four meals came out and the other one never came. Not once were we offered refills on water or drinks. There are far better places to spend your money and time in Boston.", "label": "family"}
{"text": "For a restaurant in that price range I expect that I get my steak at the point of doneness I ordered it. However, my fillet stake was overcooked to well done and was charred to a point where you had to discard parts of it. It might have happend because we were such a big group, but I assumed that thy would be able to handle it.", "label": "business"}
{"text": "This restaurant wants to be high class, but it is just another generic chain restaurant. the food is okay, but not worth the price. You're better off going to Ruth's Chris or an authentic steakhouse.", "label": "romantic"}
{"text": "Saturday night, 11/17/12, three of us, of a group of eight, arrived 30 minutes early to Mistral and were promptly shown to our table, anticipating an early libation and chitchat before the others arrived.After many, and I mean many, attempts at recognition, we finally caught the attention of a waiter to take our orders, which did not arrive until our entire party sat down and were considering their own drinks. Strke number one. Strike number two,the noise level in this restaurant is almost too much to bear. One person to the left or right is hearable, but beyond that, learn how to smile and nod. Strike number three, the tables are so closely packed that one finds oneself constantly assaulted not only by wait staff but patrons. Those who have back ailments should steer clear. Strike number four, quality of food that, pricewise, can be upwards of the mid 30s for entrees, high 20s for appetizers, leaves much to be desired. Why I gave the restaurant the rating I did is because of the foie gras/duck confit dish, which I personally found to be remarkable. Apparently, the entire table extolled the virtues of the appetizers, most particularly the mussels and tun tartare. It's the entrees that fell far short of menu promise. My husband's veal dish was inedible. He did not complain, not his style, but, man, I would have sent it back. The duck was dry and tough. /the salmon, ordinary. My pizza, not an entree, was good, but it was too much. There was general discontent with the entrees. Strike number five, probably redundant, but general laziness of waitstaff, or disinterest in the experience of the patrons. Who knows? Whatever it was, we are determined never to return to Mistral. And we visit Boston once a year with colleagues, which, believe me, I will alert. Perhaps it was an off night, but Saturday? That's the day I'd really want to make sure my restaurant was tip-top. So, good apps, bad entrees, bad service, loud venue, great greeters. Two stars out of five.", "label": "business"}
{"text": "Joined a group of about 20 for a wonderful dinner at Ocean Prine. Often times these kind of group dinners can have long delays, poor service, inconsistent food, etc —- not the case at all here. From end to end the service was fantastic, the waiters were nice and anxious to help, and the food was fantastic across the board. I would recommend the calamari, in particular, which had a great spice to it. Highly recommend for a business dinner or special occasion", "label": "business"}
{"text": "Wow, everything, I mean everything, was exceptional!!! The service, the bread, the butter, the wine pairing, the appetizers, the main course and especially the desert:)! Forgot to snap a picture of that before we dove in. This was where we chose to go for our first night out in 4 months and boy were we happy with the choice! We both cook and consider ourselves foodies with pretty good technique and creativity, but it’s places like this that demonstrate meal creations at a whole other level. The depth and complexity of the flavors was just superb. On the walk back to the car my husband was complaining about how full he was in one breath and demanding to know when we could go back in the next :)", "label": "romantic"}
{"text": "Nice restaurant, good menu. I would love to see more sea food dishes. The place is expensive, and French cuisine should be pricy. Except, I don’t think it’s right to charge 11 dollars for a bottle of “Pellegrino” or make 400% mark up on wine bottles. They charge 72 dollars for OK bottle of “2015 Chablis, ‘Champs Royaux’, William Fevre (Chablis) that in retail goes max at $17.98", "label": "romantic"}
{"text": "We arrived at the North Street Grill and noticed a crowd of about 12 people. Having registered our name we waited a short while, about 15 mins. The wait was well worth it. The service was friendly and welcoming. The main problem was the menu was so comprehensive it was hard to know what to choose. While we were choosing we were served fresh complementary banana loaf. The food when it came was excellent. We had the Steak Bomb omelettes, the salmon omelette and a stack of cookie dough pancakes. We consumed as much as we could, which was no men’s feat as the portions were very generous. A really nice breakfast all round.", "label": "family"}
{"text": "We were a party of 7. They don’t have a printed beer menu and the waitress rattled off pretty standard offerings. I ordered a beer and after finishing it was never asked if I’d like another. After ordering, the app’s came out very quickly. I had the lobster bisque which was brought to the table with the lobster in the bottom of the bowl and the bisque poured over it in front of me. The soup delicious. The lobster was part of the tail and a piece of a claw. The downside was the lobster tail wasn’t fully cut into bit size pieces and was undercooked. It was a little awkward, trying to cut the tail with my spoon. Most of us finished our appetizers but two people were sill eating and they stared clearing plates. When the second to last person finished theirs, their plate was whisked away. I was sitting opposite the last person and I could see the wait staff peering into their bowl to see if they had finished. At one point they stopped eating to join in a conversation and the wait staff asked are you done, and the bowl was gone. Within moments our dinner arrived. Wonder if they had the table booked after us and were rushing us along to free it up. The whole dinner did feel rushed. I ordered the blackened snapper. Now I was thinking, snapper is usually a thinner piece of fish and blackening, well, is usually a thicker layer of spices cooked over high heat. I wondered how they could do that on a thin piece of fish. Well, not very successfully. The fish was thin as expected, but the blackened was more of a sprinkle of barely seasoned herbs. Yes, the fish was moist and tasty but not exactly blackened. It was served over a light cream-based sauce with a few pieces of string beans, a few pieces of onion and pepper. Overall it was ok. I wouldn't order it again. Two deserts I tasted were the crème brulee and chocolate cake. I had asked for chocolate ice cream instead on vanilla with the cake. A runner brought out the desert and it had vanilla and not chocolate. I mentioned to him that I had asked for chocolate ice cream. He made quite a face but took it away without a word and promptly returned with it re-plated it correctly. Mistakes do happen, but the interesting point is someone else at the table, commented, “did you see his face when you said the ice cream was wrong”. However, both deserts were quite good and generous portions. Overall, I was disappointed. Prices are on the high side, yes portions are bigger than average, but service wasn’t up to the level is should have been.", "label": "business"}
{"text": "Fantastic food, atmosphere, and staff! My boyfriend and I went to Tresca after reading online reviews and we were NOT disappointed. We were sat right away for our reservation at a very comfortable table upstairs and had a very attentive and professional wait staff. One of the owners and chef, Richard Ansara even came out to speak with some regulars that were sitting next to us and started to chat with us and talk about his food and Boston sports. We ordered two appetizers to start, the lobster stuffed mushrooms and the stuffed meatballs. We then ordered our entrees and went with the chicken Parmesan with bolognese and lobster raviolis. We had a fabulous evening and we will be back!", "label": "romantic"}
{"text": "Large wine selection Staff knowledgeable and friendly Great location Fresh ingredients Clam shower was very tasty Fish was excellent If you are in Boston you should stop there !", "label": "business"}
{"text": "Best steak i ever had. Super restaurant and great staff. Would love to go again. Massive portions. Unreal.", "label": "romantic"}
{"text": "Davio's gets 5 stars all around from me. Ive been numerous times and have NEVER had a bad meal or experience. I got the Angus Burger for lunch and for dinner i got the Gnochi. Both are OUT of this world!!!! The restraunt is clean, bright, romantic, not overly noisy and the smell of garlic is heavenly! Davios has a beautiful open kitchen so you can see everyting being prepared right in front of you!", "label": "business"}
{"text": "Sam LaGrassa's was the one place we knew ahead of time we would eat at in Boston. My son loves a good pastrami sandwich and at home we can't go out for one so we try to when we travel. We got there shortly after 12:30 and there was no line. There was a line after us and it went very quickly. We wanted to eat in and by the time we checked out there was a table for four of us. Two of us got pastrami on a French round roll, one got a pastrami diablo which was great with spicy peppers, spicy mayo and pepper jack cheese and the 4th person got a chicken vegetable wrap. Everyone loved all of their food. To each sandwich you can add condiments for no charge or extras for a charge. You can add a side and drink to make a platter or a sandwich only. The pastrami wasn't fatty and was so moist. We are going to try to make it there once more before we leave town. Would definitely recommend.", "label": "family"}
{"text": "Great atmosphere, with a wonderful bartender who was very attentive. Ordered grilled clams that were very good. Meatball entree and swordfish entree were both beyond delicious. Will visit again next time we're in the area.", "label": "romantic"}
{"text": "My husband and I had dinner here on a recent visit to Boston. We called late in the day to see if we could get reservations and the hostess was able to squeeze us in at a tall two top near the bar. Service was very good as was the food. We had the meatball appetizer which was delicious. My husband had the gnocchi Bolognese and I have the rigatoni with rabbit and mushrooms. Both pasta dishes were excellent. Our only complaint was that it was very loud in the restaurant and hard to hear, but on a busy Saturday night I guess it’s to be expected. Would happily go back.", "label": "romantic"}
{"text": "This place was highly recommended to us when we took a food tour in Boston and it did not disappoint. The place itself is in a wonderful old building. The menu was very interesting with mostly northern Italian influences. The service was wonderful. The Osso bucco dish was wonderful. The bolognese pasta dish was very good as well.", "label": "romantic"}
{"text": "I've been coming to Prezza for quite sometime. This is the first time I've had the time to write a review. I have NEVER had a bad meal here. I have enjoyed basically everything on the menu. The food is something you need to experience yourself. From the braised short rib appetizer ( melt in your mouth ), the Ravioli di Uovo is something you will never forget. Everything is cooked to perfection. The venison, duck, potato gnocchi and pork chop are to die for. The atmosphere is addicting. If you try this once. I guarantee you will become a regular. Whether it's your date night or a business lunch or dinner. You will love it. The staff is attentive and courteous. The owner / chef comes out and mingles with his customers all the time. This is how a successful business is run. Oh! The wine list is sensational.", "label": "business"}
{"text": "My wife and I live in Las Vegas and were told by friends at the Wynn in Las Vegas and Encore in Boston to visit Tresca in the North End of Boston. We enjoyed the restaurant so much, that we returned the next evening as well! All the staff are so nice and professional…but Cruz and Rodolfo deserve 5 stars …for their attentiveness and helpfulness. The owner, Richard, treated us like old friends the minute we met. The food was not only delicious, but the presentation was beautiful as well. Must haves…The Best Meatballs , the seasonal pumpkin entree and the awesome swordfish! Can’t wait to return next year on our annual Boston trip!", "label": "romantic"}
{"text": "Great location in the Back Bay. Had heard really good things so we gave it a try. Service was crisp and professional. Food overall was very good but not spectacular. We might have gone in with big expectations however. Wine list was quite thorough. To be fair, I will go back... Just feel as though there are better choices and better value in town.", "label": "business"}
{"text": "While traveling we love finding different places for breakfast. The Friendly Toast was not to far from our hotel, and we loved the little neighborhood it is located in. The menu has intriguing options, and we ended up with the 'Donut Stop Believing' and the Breakfast Burrito. Both were okay, but in no way exceptional. The Burrito was very dry & the restaurant had no salsa! They also had no Bacon, and the Hot Chocolate was a dissapointment for a restaurant that specializes in breakfast!! I would give the Friendly Toast another try, but would definitely order something different...", "label": "family"}
{"text": "Went here for lunch on business, and great spot for just that. Nice view of the harbor, and excellent service. Believe it or not; I had the lobster roll and it was the best one I had on the trip (and I had several).", "label": "business"}
{"text": "My husband and I visited here yesterday to enjoy a restaurant we would ordinarily not be able to afford. It’s Dine Out Boston and they are offering a fixed price menu, $25 for lunch, $35 for dinner. We came for lunch and sat in the bar area. Very nice bar, plenty of natural light. I ordered the salad, cheeseburger and creme brûlée. My husband got the clam chowder, 14oz dry aged NY Strip(extra $10) and the creme brûlée. Our waitress was very nice and attentive, she brought us rolls with butter and water right away. Each course came out in a timely fashion, you didn’t feel rushed or like you were being ignored. We each ordered a mojito off the drinks menu, $13, it was delicious. Not too sugary sweet just the way I like it. Our food was spectacular. I’m not a steak person but tried some of my husband’s. It was so tender, it melted in your mouth. Cheeseburger was very juicy and cooked just the way I wanted. It can with Parmesan truffle oil fries and they were crispy and very tasty. Creme brûlée was delicious, first time I’d ever had it. We had a wonderful time and I highly recommend it. Great food, attentive service and great ambience. Dine Out Boston is March 1-6 and 8-13.", "label": "romantic"}
{"text": "Wow! I could do this every day! This place was our sweet relief on a late night trek for something delicious and special! Service was outstanding- Jean and Billy were so patient and helpful with instructions and all of our questions. Cool vibes and great family-style feel overall! Wish you guys could build one in SD!!", "label": "family"}
{"text": "After an early matinée at the theater we wanted to have dinner and Davio's was across from our hotel. The service is excellent with a touch of friendliness but not overwhelming an smiles. The food is on the expensive side. My veal tenderloin was very good, tasty not hard. Unfortunately the spinach were very salty. The French fries with truffle oil were soggy, not very good and we had to return them. The Local Burrata, La Quercia Prosciutto, Rhubarb Jam was vey good and the sampler of Spring roll was excellent. The Banana pudding with vanilla ice cream was fantastic", "label": "romantic"}
{"text": "Best Fish and Chips ever! Others had Lobster Rolls and whole lobsters. Everyone was extremely pleased. Clam chowder was some of the best I have ever eaten and was informed they will ship the chowder to you. Will definitely be doing that! Will be returning a second time during my trip to Boston.", "label": "family"}
{"text": "This is a must stop for anyone visiting Boston. Those working in the area already know this is one of the greatest food offerings in the city. That's why it's always packed for lunch. Don't let that discourage you as the line moves fast. I'm addicted to the Chipolte Pastrami sandwich... amazing. Just go and order whatever moves you... it's all good. My son sticks with a simple tuna sandwich.", "label": "family"}
{"text": "A must dinner reservation when in Boston! The staff, owner & food were beyond on our expectations! We enjoyed the meatball appetizer & lobster ravioli, clam Linguini. Our server recommended the Bolognese which we declined based on our disappointment with the dish at other restaurants. Chef & owner Rich brought out a sampling of his Bolognese which was absolutely delicious. Dessert included mini donuts.", "label": "romantic"}
{"text": "My husband and I enjoyed our dinner and the ambience at David’s. The service was attentive. I am a vegetarian and had freshly made gnocchi. It was my second time eating there and I loved it both times.", "label": "romantic"}
{"text": "Ostra is one of the best restaurants in Boston. Great food, service and atmosphere. Reservation needed!", "label": "business"}
{"text": "We had such a great experience and meal at the Sail Loft. This restaurant is my go to because it’s just off the beaten path from more tourist-centric places but still offers a great, casual dining experience. Our meals were excellent and I’m so bummed I didn’t get our server’s name. She was attentive, kind, and didn’t miss a beat with our large family.", "label": "family"}
{"text": "One of the best dinners in my life. I lived in France and the restaurant is amazing. Great service included.", "label": "romantic"}
{"text": "The man at the door told us that unless all members of our party were here he would not seat us even though we had a reservation and most of us were on time. Instead he wouldn't let us in and made us wait in the street at 32 degrees. His attitude and behavior were dismissive and very unfriendly. We left and would not recommend this place to anyone simply based on the door man's poor attitude and inflexibility.", "label": "family"}
{"text": "Joined our friends for dinner while in Boston for business. Great atmosphere, classy and amazing service. Everything that we ordered was delicious and on point. I have found my new favorite place while visiting.", "label": "business"}
{"text": "Well that's strange for me because I dont like home fries! My breakfast sandwich was fantastic with very good bacon and perfectly cooked eggs. The home fries had a good crisp and a unique taste.", "label": "family"}
{"text": "Went out to eat with my family on a busy Saturday night. I was thankful that I was able to make a reservation. (Call them directly they don't use Open table). The food was delicious and portions huge. I was bit disappointed that we felt that we were rushed. The waitress also was quite pushy in telling us which pasta we will have with our meal rather than making a suggestion. Additionally I had reviewed the wine list before I went and when we went to ask for a particular type she dismissed it and said that she'll pick one. It was ok but I felt rushed and dismissed. I get that I think she was trying to help but maybe it would be helpful to listen to her patrons as well. Overall a nice time and delicious food. I will definitely go back maybe with my order already in my mind.", "label": "family"}
{"text": "This may be the finest dining experience that we have had in quite a long time. First, seating was prompt even though we arrived twenty minutes ahead of the time for our reservations. Second, The restaurant is staffed with adults as waiters who can intelligently advise and recommend drinks, dishes and desserts. I had the Il Affumicatto, a very original margarita and my wife had the Puccini Cocktail, vodka based. My wife had Pinot Nero, a glass with dinner. We shared a wonderful Romaine salad. My wife had Rabbit Pasta and said it was superb. I had the Halibut, just perfect, with mushrooms, Salsa Verde and creamy parsnips. For dessert my wife had Limoncello Mouse, that she said was incredible and I had blood Orange gelato. If we lived in Boston, we would visit weekly. Highly recommended!", "label": "romantic"}
{"text": "Went with a group of 16 on business. The place was small, in a beautiful area in the North End. Everything we tasted was delicious— from the bread and wine, to the appetizers, to the entrees. We sampled multiple appetizers and everyone loved everything. Each plate looked like it had been licked clean! I had the halibut as my entree, and it was outstanding. Highly recommend!", "label": "business"}
{"text": "This Italian restaurant in the. North End was highly rated so we booked a reservation. The service was slow and the food was mediocre. First of all beware that the plate portion sizes are gigantic. So if you order antipasti and salad and then a pasta dish (we ordered a manicotti dish that was enormous for 3 people). The Bruschetta plate was almost like pizza bc they bring you 4 large pieces with melted cheese on top. The house veal dish had a mushroom sauce that was sweet - tasted like they added maple syrup to it. My wife’s lemon chicken dish was probably the best one but again was a huge plate. My son had the house special which had chicken, veal and sausage. The veal was dry and chewy - not sure it was really veal. The sausage was almost inedible. The sauce was watery and not very flavorful. Bottom line - there are Much better spots in the North End.", "label": "family"}
{"text": "We enjoyed the buzzing, friendly, professional service at Prezza. Our waiter was charming, old school professional; attentive and efficient. I ordered the halibut which was a hearty size of perfectly cooked fresh fish with a delicious mixture of purée and lightly fried veg. My dining partner ordered the shrimp pasta which was flavourful and cooked to perfection. This popular North end restaurant didn’t disappoint and has definitely become our favourite in the neighbourhood.", "label": "romantic"}
{"text": "Nice service and ambiance. It feels like I could be in France. The three course dinner is a real value. The food is really great. Really wish the foie gras was taken off the menu however. Geese are cruelly force fed to create the foie gras. Look it up!", "label": "romantic"}
{"text": "When I stayed in Boston while I joined the ICPE conference last week, I made a reservation and went to this restaurant. The atmosphere of this restaurant was great though the light was a little bite weak. The steak there was perfect. I ordered filet mignon, medium and it cooked so well. If I have a chance to visit Boston again, I think I will go for another big meal next time.", "label": "business"}
{"text": "This restaurant has been around as long as I can remember. Good food, at a reasonable price, perfect for a family outing. You can even bring your own alcohol if you prefer that kind of drink.", "label": "family"}
{"text": "Great meal with customers. Steaks were excellent, seafood tower was awesome, and a highly recommend the Gin cucumber gimlet as a starter cocktail.", "label": "business"}
{"text": "My fiancé and I went yesterday. The food, cocktails and service was exceptional. We were honored to be giving the famous 77 table overlooking the beautiful north end. The owner/chef would check in with us frequently to make sure that we were satisfied. This was a truly rockstar like experience and highly recommend everything about Tresca", "label": "romantic"}
{"text": "This was to be our 'special meal' whilst in Boston. The food was good but the staff seemed full of their own self importance. We sat in a row of tables that were for couples. There were 5 tables lined up against a bench (one side of the seating) with chairs at each of the tables, on the other side. You were so close to the person next to your table there was no privacy. Our fellow diners' conversation seemed to dominate our evening, not their fault, just very bad seating plan. There were empty tables for couples elsewhere in the restaurant so I am dumbfounded as to why they seated so many people so close to each other. When I informed our waiter I had a dietary requirement he asked if this was an allergy or just an avoidance!!! When we left we asked the 'front of house' if he could arrange a taxi. The response was 'I'll ask the valet'. Clearly he thought this request was beneath him, which basically sums up the evening. Would not return. There is no need to be so pretentious, service is service, whether from front of house/waiting staff or valet - get over yourselves please.", "label": "romantic"}
{"text": "Like eating in an auditorium during a game. The noise level was deafening. The waitstaff was not professional and not available. The food was good but served lukewarm. Nothing about the restaurant was French. It was outrageously expensive. Go somewhere and get a lobster roll, don’t go here.", "label": "romantic"}
{"text": "This is an amazing culinary experience! Classy, clean, and spectacular seafood. Really high ceilings, expansive wine list, and terrific service. Prepare to explore and be exposed to creative preparations of the finest quality food. I would come back for sure. One point, I didn’t see the valet sign or staff at 5:50 pm, but it was there when I left. Maybe I missed it, but self parking can be a little tricky in this area. Better to walk or use a car service.", "label": "business"}
{"text": "We visited Boston in October for my birthday and ate here that evening. The chicken parm was AMAZING! It was some of the best chicken parm I've ever had. My husband got the seafood alfredo ravioli and he loved it. Cannot go wrong here, if we ever make it back to Boston this will be a must visit!", "label": "romantic"}
{"text": "We needed to try some Boston Burgers, and this place didn’t let us down !!! Menu was huge, with some unique dishes. As per normal, we ordered way too much, but the quality and flavour was amazing. Service was really good, and people were queuing in to the street !!! Amazing", "label": "family"}
{"text": "Appetizers came out 2 minutes before meal. Mussels were huge, never had them that size and the weren’t good., broth had little flavor. Clam chowder was the worst I’ve ever had. Out if 4 of us only 1 of us ate it. Odd flavor, very thick. My crackers came already open. Server never checked on us, never was able to get the kids refills and never offered a second drink. Lobster roll was good, fries below average. Took forever to get the check. Would not return.", "label": "family"}
{"text": "I had the pleasure of planning a corporate holiday dinner at Mamma Maria and have nothing but high praise. From the beginning of the planning process, Jennifer was extremely responsive and very patient as I worked through some of the details in the days leading up to our dinner. We had the Rossini room, which was decorated beautifully for the holiday. From the moment I entered, the service was outstanding -- attentive, without being cloying. The passed hors d'oeurves during cocktail hour were so amazing, we found it difficult to save room for dinner, but we were all glad that we did because the dinner was incredible -- from the first course of pasta through the desserts. The only \"disagreement\" was about personal favorite items. Everything was wonderful! Once we were seated, the food started flowing out at a pace that never felt rushed, but we also never were looking around to see where the food was. The same with the wine. There was never an empty glass at the table, unless the guest made that choice. I would highly recommend Mamma Maria if you wanted to have a fabulous Italian meal in Boston's North End in one of the most charming settings you will find.", "label": "business"}
{"text": "Two couples went to Mama Maria for dinner on a Monday night located in the historic north end. Valet parking is available and a necessity as the streets are narrow and on street parking is rare. Valet parking costs $30.00 but is worth it. We were seated upstairs at a cozy table. Our server, Guilherme, started us with a nice bottle of Prosecco. For appetizers, we chose; mozzarella and tomato salad and a roasted beet salad. Both were large enough to share. We were given warm bread with a pesto sauce and some ripe olives to munch on. For entrees, we chose; ravioli de zucca, lobster agnolotti ravioli, seafood paccheri pasta and Ossobuco. All of the entrees were excellent and very plentiful. We had a nice Chianti Classical wine to enhance the meal. The service was excellent and no one had room for desert. This is a great restaurant.", "label": "romantic"}
{"text": "Good food, good service and attentive staff. I was entertaining a group of customers and the atmosphere was fun, but a tad loud. Food is on the expensive end and i would have expected it to be better than good.", "label": "business"}
{"text": "Today my wife and I attended a private event at Mistral for brunch. Since we are both mostly-vegan (and since brunch choices are often egg, dairy and meat-centric), I decided to call the restaurant the day before to ensure we would find some options we could eat. The host I spoke with was accommodating, put me on hold for a couple of minutes to talk with the chef, then returned to the call and assured me the kitchen would prepare vegetable plates for us both, Wow, did they ever! We were presented with copper gratin dishes, filled with beautifully prepared roasted peppers, semidried tomatoes, green beans, young spinach, grilled asparagus, and maitake mushrooms. A second dish was delivered: mushroom carpaccio, topped with arugula, olive oil and a light touch of balsamic vinegar, along with plumped-up raisins. While the buffet for the other guests was excellent, those at are table were jealous of our meal. To top off the experience, the restaurant manager, Brian Corbit, came over after 20 minutes to ask if we were pleased with the meal. Overall, the food, the service, and the room (The Salon) were all outstanding. One of the most capable and responsive high-quality restaurants I've seen in years.", "label": "business"}
{"text": "We got there and were seated. We waited a looooong time for food, and when it got to us, it had sat so long it had gotten cold. I am not a complainer in a restaurant, but this food had gotten cold. All three of us had chilled food, so we told our server. She tried to argue with my mother that she saw steam, so hers couldn’t be cold. Finally we got her to heat it, but she was not happy about it. Water glasses would completely empty, etc. When we finally did get hot food, it was certainly delicious, but we were there a long time, and her attitude made it a bad experience.", "label": "family"}
{"text": "Nice place, nice atmosphere, lot of people, casual, informal. I had a taste/3plates menu. Entrance (carrot soup) delicious. Than the ribeye was good, but french fries came soggy, toooo much oil. The desert best options were also finished (chocolate mousse and creme brûlée). We had a strawberry smoothie with champagne, but I over estimated it. My husband had terrine foie gras and duck. He liked both.", "label": "romantic"}
{"text": "We recently visited Boston and wanted to try this restaurant as we remembered it from an episode of Guy Fieri's \"Diners, Drive Ins & Dives\". When we arrived we were warmly greeted by the host who brought us to our table. He was also happy to make us change in quarters for the old style parking meters on Boylston Street outside (quarters only). The decor was pleasant and the atmosphere upbeat. They have a nice bar set up near the entrance. Our booth was roomy and clean. Our drink order was also taken promptly and arrived quickly. Refills were offered periodically. By the server without much prodding. The signature dish on the show was the Mac N Cheese Burger, so we ordered that. The meal came with some potato chips and our server recommended we get an order of fries in addition. The burger came with a large dollop of Mac N Cheese, and bacon strips. The Burger was cooked to our specifications, but it unfortunately did not have very much flavour. The large amount of Mac N Cheese, while tasty, did not salvage the overall underwhelming taste of the burger itself. We were disapppointed. The potato chips that come with the meal were alright, and the fries were ok as well. The server's advice to get both was in fact overkill, and we left some of both leftover. We are not sure what Triple D saw in this dish, as it was ok but really nothing to recommend or write home about. Good service, nice atmosphere, yes.....but that wasn't the draw in the first place. Prices were in line with what we expected for a gourmet burger joint, moderate to inexpensive. Overall, while the people were nice and the atmosphere inviting, the food really is ok at best. On our next trip to Boston, we will certainly try a different place and will not likely in all honesty return here. If you thought that this review was thorough and helpful, please click \"Yes, Helpful\" below to let us know. We rely on trip advisor for honest advice before trying new hotels, restaurants and attractions, and we leave feedback accordingly :)", "label": "family"}
{"text": "The steak was good, but not amazing, the Pom frites were soggy and cold, (yes they brought me more, just as I was finishing my steak) the salad was good and the deserts were the high light of the evening! Can't imagine going back!", "label": "romantic"}
{"text": "We were staying at the Park Plaza for a business meeting and saw that this place was highly rated and within walking distance, so we had to check it out. We were not disappointed. The food was delicious starting with the fresh raw oysters that we shared (had three different types), all good. We also had two different types of soup, both very good. The fish of the day was nicely prepared to order, though the portions were big. Did not save enough room for desert. The selection of local beers was also very good, as was the selection of wines. The place is large and a bit noisy, but we had a great time. I would definitely recommend it.", "label": "business"}
{"text": "Just off Hanover St. this little gem has a very authentic Italian feel. We made reservations and were glad we did. There aren’t many tables and around 7pm they were pretty busy. We had ravioli as an appetizer and they were fantastic. The gnocchi and tagliatelle with meatballs both appeared to have homemade pasta (based on look and taste) but the Pasta Spinaci and Chicken Parmesan appeared to be boxed penne, despite being told the pasta was made in house. Still not a deal breaker though, the food was wonderful. The only thing better was the service. But plan for a longer dining experience, they aren’t in a rush to push you out the door, which we appreciated. This is a family owned and operated restaurant which we love to patronize and the matriarch Barbara even made an appearance.", "label": "family"}
{"text": "It's a steakhouse but I had fish and loved it! I did not feel like steak and the salmon I had was just perfect - moist, flavorful and melt-in-your mouth - good to know if there's a less than enthusiastic carnivore in your party. The sides are wonderful also, especially the creamed spinach - fresh, not overcooked and the flavor was amazing. Great service - it was like watching a ballet or performance of some sort. Very noisy, not what I would call a romantic type place but definitely fun for people watching!", "label": "business"}
{"text": "This was my first trip to Boston. I was attending a conference for three days. David's was a highly recommended choice by FindMe GlutenFree app, and I now know why. David's has the most extensive gluten free menu I have ever personally experienced in a restaurant. That said, the rest of their menu was extensive and varied. My dinner that first night was outstanding. Since being diagnosed with celiac disease, I had never before been able to eat gnocchi while dining--which is exactly what I ordered from the gluten-free menu. These were little pillows of heavenliness--as was my starting appetizer. (You can find my pictures from Davio's at Steph.simply on Instagram and Facebook.) Additionally, the bar staff, where I sat, was attentive to my every need, friendly beyond my expectations, and very helpful at recommending wine and food. Anna, Erin, Kim, Danielle, and Juan the bar back were all absolutely the best staff with whom I have ever interacted. In fact, I was so impressed after the first night, that I returned every single night I was in town. Furthermore, I loved it so very much, I am driving 13+ hours two weeks after this visit to bring my husband and daughter to see the city, and more importantly, eat at Davio's. I swear, I dream of this food and wish there was one closer! Outstanding dining experience, beautifully plated food that tastes even better than it looks, a warm, inviting atmosphere, and THE BEST BAR STAFF!!! If you've never visited--you have to make this the trip to Davio's. You will not be disappointed--especially if you sit at the bar!", "label": "business"}
{"text": "We were a walk in on a very busy evening but they told us to wait and after 15-20 min they could seat us. It appeared there were only 2 waiters and 1 clearer for the whole of the restaurant so they were very busy. The service was friendly and prompt so they did a fantastic job keeping up with that many customers. The food was average though and we were totally thrown by two whole sausages being served ontop of our pasta- I know we ordered the sausage pasta but expected it to be all chopped up and tossed into the food and being honest none of the flavours in this dish really worked together so we mostly ate all the fresh brocoli. Our other dish was creamy and was ok, nothing special unfortunately. There were quite a lot of people finishing their food with half empty plates and whilst we were waiting to be seated saw a few others picking at it and struggling with the pasta stuck together. Maybe they had an odd night of being understaffed but for us this was just an average visit and served a purpose.", "label": "romantic"}
{"text": "My love and I recently had the pleasure of dining at Davios during our last night in Boston. The location and ambiance of the restaurant was beautiful. It was appropriately priced for a fine dining experience. He had the lobster risotto which was good and nicely cooked. I had the braised beef short ribs that were amazing and ordered a size of Mac and cheese with truffle oil. This is was pulled the meal down. I like to think I'm a little bit of an M&C connoisseur. This had a thin, bland, grey cheese sauce and the noodles were gummy. Kraft would have been a better replacement. Not sure if its always like this or if mine was just poorly executed but overall it was an enjoyable dinner and we would go back again", "label": "romantic"}
{"text": "One good thing about Covid is no wait! We were seated right away. Omelette with Brussel sprouts, home made raisin toast, avocado toast and a flight of mimosas. So delicious! Happy we got in.", "label": "family"}
{"text": "Gorgeous food experience. Impeccable service, amazing dishes, fantastic wines. Well done to the chef and the team! Worth trying and coming back for more", "label": "business"}
{"text": "Ursula, the owner, made me some pasta with Italian sausage and broccoli rabe. It was wonderful. I also tasted one of their pasta dishes with red sauce and that was very good. Ursula and her staff were warm and friendly. All in all, a relaxed, pleasant evening with good food.", "label": "family"}
{"text": "We had high expectations because we heard much about this sandwich shop. It fell short and it is very pricy...$14 for a lunch sandwich...You can have a dinner plate in some restaurants.", "label": "family"}
{"text": "We enjoyed this quaint restaurant in the heart of North End. The food was very good and the service was excellent. We got the Bolganese Pasta & Chicken Marsalla.", "label": "family"}
{"text": "Food is delicious .. and definitely a memorable experience .. feels like your Italian grandma is in the kitchen and cooked for us This is the kind of place where you want to go back !!! The house is very different from typical restaurant in the us .. it’s small, quiet.. with some charm Service is professional and not overwhelming ( which is a good thing!!) I had the razor clams and they were so good Mamma Maria definitely desserves its reputation", "label": "business"}
{"text": "My $46 Osso Bucco was overcooked; Mama Maria has a far superior offering. Our wine glasses were empty forever before our server stopped back. Service was not attentive at all actually. I did like the crispy shrimp and meatball appetizers. But at nearly $400 for 4 people I was extremely underwhelmed.", "label": "business"}
{"text": "My daughter and I were in Boston for the Marathon. A guest at our hotel and the hotel staff recommended the restaurant. In fact, it was so good that we ate their twice. Ursula has wonderful specials, an electic menu, and will keep your wine glass full. Definitely don't miss this wonderful Italian food.", "label": "family"}
{"text": "We went to Davio's for dinner after the Boston Marathon. I was worried we were dressed too casual, but I don't think it really mattered, certainly not that day. I did make a reservation ahead of time. Our server recommended a cab sauv that I really enjoyed. When I couldn't decide between two entrees, she recommended I do half portions of each. Great option! She was very attentive, but the buser was also fantastic. Always had water, never a cluttered table...We definitely enjoyed our time at Davio's and would recommend for a nice dinner out.", "label": "romantic"}
{"text": "This was our second time dining. I will say sitting at a dining table the level or service is winner compared to dining at the bar. We had the house special was a veal dish that was outstanding, also ordered the mushroom risotto not as good as our first time. We closed the evening with the dessert sampler. There are many more great Boston restaurants to try. It still remains one of my top picks", "label": "business"}
{"text": "Had a great dinner here this week. Service is great, food excellent. I had the 100 day aged rib eye, with a side of tater tots in truffle oil, and brussel sprouts. Tater tots were great -- super light on the inside, nice thin crunch, and a definite truffle favor. Brussel sprouts with raclette and bacon was a great idea, nice combination, if a bit heavy. The steak was really good, I was a bit skeptical because just for the record, the 100 day rib eye is WET-aged not dry-aged (some previous reviewers incorrectly stated that it was dry aged). It is a bit confusing, since the menu doesn't specify, so I asked the server. It's definitely wet-aged. I love dry aged steak, and do my own dry aging at home, so I was skeptical, but had to give it a try. I really did enjoy it -- very very tender with nice beefy flavor, although none of the traditional funky flavor from the dry aging process. I really want to understand how they do it, and why their wet aged process produces such a nice steak. Maybe it has more to do with the quality of the meat, than the wet-aging, and the 100-days is just a red herring? One downside -- they should really have a better selection of wines by the glass. Not a huge deal, since most people order bottles, but for those that do prefer wine by the glass, they should really have some better choices.", "label": "business"}
{"text": "While travelling for business, a group I was with chose this restaurant for an evening meal. I live in Spain, and while I was in Boston on business, my wife was also travelling on business in Brisbane, leaving our two sons (8 and 11) in the care of my wife's brother. I obviously wanted to check in with my wife and with my kids so when I saw the wifi come up, I asked one of the waiters for the password. He refused to give it to me. I asked to speak to someone to complain to. The evening manager showed up, and while he was understanding, he didn't give me the password either. This ruined a perfectly good night out for me. All I wanted to do was send them a couple of Whatsapp messages saying \"Hi!\"", "label": "business"}
{"text": "Dropped by last minute last night. Nice looking place, very nice decor. Very nice reception by the hostesses. Waiter was very friendly and knowledgable. Those were the good points... Went for the pasta with truffles. Once you get past the ridiculous price, you hope you end up with a memorable dish. Nope... Truffles were bland, sauce was bland, pasta was non-descript. My wife's macheroncini with polpete was also mediocre. Dessert (Apple with caramel) was reasonably tasty. Overall, it was forgettable. Désolé...", "label": "business"}
{"text": "My expectations were limited given all the hype. It WAS noisy. But the wine list was solid, albeit a bit pricey, the 100 day rib eye was remarkably delicious and the service was friendly, solicitous, and, above all, highly professional! I’ll be back.", "label": "business"}
{"text": "We were in Boston the night of Martin Luther King day, having finished out shopping trip, I decided it might be nice to take in a fine restaurant that evening. We were able to get a parking space less than a block away on Berkley Street -- with the double advantage of free holiday parking. We started with a nice Onion Soup Gratinee -- a very large portion of soup that would have been a whole meal if we hadn't shared it. My wife had the beef tenderloin -- which was a very nice cut with potatoes and vegetables. I had the duck risotto -- a half-duck on a mixture of cherries and mushrooms with just a touch of rice. There was so much, I had to take it home -- and got two more meals out of it. We finished up with profiteroles -- a nice chocolatey puff pastry with wonderful vanilla. Prices are expensive, but the food is as to be expected by one of the best restaurants in Boston.", "label": "romantic"}
{"text": "The food was fantastic, but the service was not. Our server (Brian), was quite rude in urging us to decide our meals quickly when my partner asked for suggestions. When my partner wanted to confirm what Brian suggested the steak to be cooked, he responded \"We already had this conversation. Sorry, it's been a long day.\" We were both very upset and confused at the hostility. While I was pleased with the food, I would warn people that the service was surprisingly disappointing for a place such as this (especially with the cost). As a server in the restaurant industry myself, I believe this was uncalled for behavior.", "label": "romantic"}
{"text": "Get a sample of sandwiches if you have a group that you are with, and share with the others. All are terrific, bursting with flavor, and filling, recommend sharing 1/2 with another in your group.. Counter service is quick, and accurate. Did I say anything about the pastrami sandwiches? gotta have a go to, this meat is done with care and love, I have never had better....", "label": "family"}
{"text": "I took my office to Morton's for the second time for our Christmas party before a show and, once again, we were treated like royalty! Food was excellent, service was fantastic and the staff, well I can't say enough about them! Once again, thanks for making the beginning of our night so wonderful! By the way, the dog loved her T-bone steak! lol And, of course, we'll be back!", "label": "business"}
{"text": "My boyfriend and I dined here with another couple on July 2. I had made a reservation several weeks earlier, and it is a good thing, because the restaurant was full. It was not large but had a very warm feel. Our meal started with the delicious caramelized onion focaccia on the table. I had the amazing fig appetizer -- roasted figs wrapped in prosciutto, stuffed with melting gorgonzola cheese and drizzled with aged balsamic vinegar. I also tried the zucchini flower appetizer -- lightly breaded and fried, stuffed with cheese, served over polenta, pancetta and roasted tomato. It was very good, but the figs were the clear winner. For my entree I had the tagliatelle a la bolognese. This was no run of the mill bolognese; It was a rustic meat ragout mixed with a porcini cream and pecorino cheese. For dessert, I had the recommended white chocolate bread pudding served with vanilla bean ice cream and creme anglaise. I also tasted our friend's strawberry-rhubarb cobbler, which was good, but my dessert was the star. Service was attentive, and the food was wonderful. I would return in a moment!", "label": "romantic"}
{"text": "Service was terrific. Atmosphere was typical Newbury St so that was cool. But the food... Pass. I've been to France too many times to say this reminded me of anything French. Except for the wine. It was ok but Trader Joe's sells the same bottle. The martini was weak. The fish was bland. The ratatouille was soggy. Oh, the bread was good. Forgot about the bread. The waiter didn't even speak a word of French. I won't be back.", "label": "romantic"}
{"text": "My wife and I took our 2 HS age daughters here for brunch. What a fantastic place! Small and cozy, with a very diverse menu of amazing brunch choices. Too many to go over here, but do want to note the French toast, which can be stuffed with many different fillings (Nutella, bananas, ham, etc.). Also the fresh squeezed oj was amazing, and came in a huge glass at a great price. Really good attentive service. Place was packed but we did not feel crowded. Highly recommended.", "label": "family"}
{"text": "When this place fires on all cylinders, like it did last night, it's fabulous. The room is very nice, modern, comfortable, stylish. When it's not crankin' it's a really laid back sophisticated dining experience... this is when it's at it's best. Highly recommend the Veal Saltimbocca and the pasta dishes.", "label": "business"}
{"text": "Awesome! Just awesome! The service was great, the ambiance was fun, and the food was terrific! This was a hoping, busy Sunday evening in February (2/16/2020). We waited about a half hour for a table- we didn’t have reservations. But, it was well worth a little wait. Nice people and fantastic food. We highly recommend giving this place a try and will definitely be back.", "label": "family"}
{"text": "Fantastic experience for our anniversary meal! The hostess made us feel very welcome from the first moment we arrived, sharing a brief story about the restaurant history. The authentic Italian food was absolutely incredible. The service was prompt and friendly but not overbearing. We highly recommend!", "label": "romantic"}
{"text": "Maybe I'm splitting hairs, but, shouldn't a $50+ steak blow you away. My bone-in rib eye didn't. Sure, it was good, but, just not great. I was part of a business dinner at the Grille on a weeknight. They took us right on time, and seated us right in the gaze of Red Auerbach who looked very happy there. It's easy to pour scotch on the rocks, but, the pour was large. Later in the evening, the bar came up with an ice sphere with orange peel for my friend's Burbon - a coup that became tastier as it melted. I was the only one with a starter - a salad special with dried pork, fresh heirloom tomatoes and a fresh cheese on the top - not diet, but awfully tasty. It was the steaks, of all things, that disappointed. We all had bone-in Rib Eyes - two medium rare and mine rare. Yes, they were good, but, nothing special. I do better on my grill at home. So, do I recommend the Grille? Yes, for a special place with great service.", "label": "business"}
{"text": "We sat up front near the main window. Family table, Paul our waiter was great. He recommended great wines and even brought us a few off menu items from the chef. His dinner recommendations were great. It is not inexpensive, but you get what you pay for here and if you can you should not be disappointed here.", "label": "business"}
{"text": "The staff was friendly and attentive. The food was clearly made on site and delicious. We got the tiramisu because they made it fresh that day and it was the best I’ve tasted. Totally worth going off the main drag for a quiet meal together", "label": "romantic"}
{"text": "For whatever reason I thought it would be a good idea to visit Boston for New Years and my birthday on the 30th (turned twenty!). It was terribly cold and rainy and the hotel had no hot water but the saving grace was this restaurant. We waited about an hour for a table, about thirty minutes past the wait we were told it would be, but nonetheless we persisted. The restaurant was small but well decorated. We were intrigued by the shakes we saw people eating and the menu online. The open kitchen was a nice addition. I ordered hottest boneless buffalo wings with blue cheese and the chocolate peanut butter shake and my mom got a burger with the chocolate shake. The wings were great with the right amount of heat, and my mother said her burger was on the best she’s had. I even dipped a few wings into my shake- pretty good. The peanut butter shake was large with every flavor coming through and melding together. I could have done without the decorations but it was trendy so I’ll forgive it. My mother thought hers was just as decadent. It was a great meal and we want to come back as soon as we can to eat it again.", "label": "family"}
{"text": "I recently ate here with colleagues from work. David's is a large, beautiful restaurant. The spaghetti carbonara with duck bacon is amazingly delicious! It's quite filing so you may not need an appetizer. My colleagues had steak, perfectly cooked to their liking, and both loved it. The service is excellent as well.", "label": "business"}
{"text": "Best atmosphere, delicious steak, great service. Went there on our trip to Boston & my firs time in the USA. We had a very nice evening. My coworkers enjoyed the great Steaks. Definitely coming back if we get the chance...", "label": "business"}
{"text": "We went to Boston for our 20th anniversary. We looked at a lot of places (Boston has so many restaurants to choose from!) and decided on Davio's based on the menu. I really wanted to try the black ink pasta dish. We made reservations through Open Table the afternoon of our visit. We were greeted warmly by the front staff. We forgot to ask (beforehand) for a quiet table; the main room where we were seated was noisy. I did not have a good view of the open kitchen. Our table was also next to one of the columns (our waiter could not get to my husband's right side & my left side) and too close to another table. Maybe our table was a last minute addition due to the last minute reservation. After we were seated, we were served puffed pastry, butter & water. Our waiter, José, was wonderful - attentive without being intrusive, extra patient (reservation for 7pm & left after 1030pm) and very accommodating. He explained the different pastas, how only Davio's have the Brandt Beef, that the restaurant is a la cart. He was able to change the entrée (Squid Ink Conchiglie Calamari) to an appetizer for two (we also ordered the grilled octopus) and split the 18 oz. Ribeye for us. We had many sides - horseradish mashed potatoes (husband loved this one also & already made his version of this dish at home), broccoli rabe, asparagus. For dessert we had Boston Cream pie and bread pudding. My husband was not sure of the squid ink pasta dish but declared it so delicious & that it was his favorite food that night. The staff was very attentive. I witnessed one of the waiters help a lady patron put her coat on. When my husband went to use the bathroom, the ever-roving manager stopped by our table, took my husband's napkin and put a fresh one on the table. When he saw me coming, he was also quick to guide me to the bathroom even before I could ask where the bathroom was. José would occasionally scrape the crumbs off our table (although he could not access my husband's right & my left side) and change our silverware after every course. A small anniversary treat surprised us at the end.", "label": "romantic"}
{"text": "A lovely location and really lovely ambience. Staff at the entrance, the bar and the restaurant are incredibly nice. Menu is not overwhelmingly long, great quality food and good wine selection. Tiramisu is to die for! and watch for those devilish salted caramel chocolates at the end. Great all round!", "label": "business"}
{"text": "We stayed at The Newbury Guest House and this restaurant is a few steps away. We both ordered soup. My husbands never arrived. His $27 steak was lukewarm, his French fries limp and greasy, with an remarkable salad. I ordered soup first, then salad as my entree. My salad came and we waited and waited. So I ate my salad while my hungry husband drank a glass of wine. After another 15 minutes his food came and my soup. This was not a busy night (Monday) and most tables were empty. The staff were very friendly, but we really felt more effort could have been made both in the kitchen and out. This $70 meal - $84 with tip- should have been better. Especially after reading all the rave reviews here.", "label": "romantic"}
{"text": "This place has the best clam chowder! The waitstaff is friendly and very helpful . The owner was walking around talking to the customers . You don’t see that everyday . He was genuinely interested where we were from , how we liked the clam chowder, and answered all of our questions . Super nice guy. He saw us trying to take a selfie in front of the sign , so he came out and took it for us! We went back several times because they have other entrees also . This place has great food !", "label": "family"}
{"text": "Although the drinks were a bit pricy, the food was worth the $$$$. I enjoyed the most amazing New England Chowder with lobster and sausage in it. This was one of the best bowls of soup I've ever ordered! My wife ordered the Twin Petite Fillet's. They were perfect according to her. I'm not much for that cut of meat. The Ribeye was a bit pricy so I actually went for the Skirt Steak (Steak Frites). It was delivered too well done on round one, but round two was cooked to perfection. The desert was a chocolate tarte. It was amazing as well. We'll be back the next time we're in Boston!", "label": "business"}
{"text": "The gnocchi was wonderful with the pink sauce! It was piping hot, pillowy, homemade, and exactly what I was looking for! I’m glad we came here. They ran out of lasagna right before we ordered, so a couple of people in our party had to make another selection and chose a pizza. They said it was amazing. They said the sauce was different than a usual pizza and very good. Another person in our group ordered eggplant and said it had a little too much cheese, but gave it to someone in our group and they loved it. The bread and dipping sauce they give you isn’t that great - bitter. All pastas are homemade! The portions are HUGE. You will most likely have to wait in a long line, even on a weeknight, but it goes fast (around 20 minutes for us). There is NO street parking except for residents. After circling the blocks several times, I asked a valet at another restaurant where to park (no valet for this restaurant). There’s a lot on Cooper, but it was full. There’s a parking garage a few blocks away and it’s about a 7 minute walk to the restaurant from there.", "label": "family"}
{"text": "I sort of feel sorry for Morton's as they were one of the first higher end restaurants to locate in the Seaport area. Then Legal Seafoods put up their building and Del Frisco's is now competition with a better view for the steak and martini crowd. The several times I have been to Morton's for lunch the wait staff just can't get it right. The food is always good, well presented, but something is missing here and I can't put my finger on it. There is no pizzaz to the place? A nice restaurant for a business lunch though. More conservative than Del Frisco's . I prefer Morton's for a business lunch.", "label": "business"}
{"text": "My colleague loves this restaurant. We were on a business trip and wanted steak. I loved the steak, I found the food was excellent. Our server saw we were not drinking , so we got second hand treatment , didn't even recite the specials to us. So I felt he was doing us a favor even though we spent over 200.00 . The food was excellent!", "label": "business"}
{"text": "Had a delicious dinner there. The menu, in a rather cliche fashion, bills itself as \"Northern Italian\" to make sure you won't think there are any low class red sauce dishes. But the menu did indeed have a good selection of both standard and novel dishes. Service was pleasant and knowledgeable. I'll plan to return.", "label": "business"}
{"text": "Spectacular in every way. Exceptional food, service and ambiance. A very special place. Menu changes all the time but loved the halibut in the carrot purée and the fruit and pistachio dessert with the sorbet. All the food was beautiful but the dessert was exquisite and tasted as good as it looked.", "label": "romantic"}
{"text": "Great fresh food! Large portions. Menu has something for everyone. Creative specials. Good service. Definitely would go again.", "label": "family"}
{"text": "Now I feel I have to go back to all previous 5 star reviews to make them lower just to balance how exquisite our experience was at Davios. First of all, the service was just so on point. Our server was incredibly attentive, but also approachable and friendly. The popovers were worth my usual no bread rule, so warm and fluffy. We shared the crab cake as our appetizer (delicious). I ordered the sea scallops was easy amazing and refreshing and I thought I was happy until I tried my husband's lobster risotto. It was criminal how good that tasted. The portions were surprisingly generous. Usually we don't leave a fine dining experience completely stuffed, but we did this time. Just a wonderful experience overall.", "label": "romantic"}
{"text": "I visited here this evening, on a visit to Boston from the UK. And was recommended Boston Burger Company, by the concierge at the hotel, and wasn’t disappointed! The burgers are spot on! Really delicious. And the shake was amazing too! Very good size portions, really great food! A must visit for a burger fan if your in the city in my opinion!", "label": "family"}
{"text": "I went to this restaurant based upon reviews. It was raining so we were able to be seated right away. Julie was our waitress who was very friendly and smiling. The cup of clam chowder was so delicious. Our entree was the lobster rolls. They were simply superb! The lobster was delicious! We were so full. I highly recommend this place! I will be back next time I visit!!", "label": "family"}
{"text": "This used to be THE place for quality steak in Boston. Now, it's a pale imitation of its former self - somewhere than can charge $59 for an entrée and serve it on a cold plate? The waiter wanted to interrupt our conversation - obviously, what he had to say was more important - and it was all a sad disappointment.", "label": "business"}
{"text": "Feels like an authentic family-run restaurant. Bustling and cozy, service was friendly but meal felt rushed. Space is seriously small, we were pressed up against the backs of diners at neighboring tables. Antipasto platter was delicious piled with high quality Italian meats on a bed of lettuce, tomatoes, cucumbers, etc. Entrees were disappointing, pasta portions were huge but flavor was lacking. We tried meat lasagna, pasta with vodka sauce and pasta bolognese, can't say any were standouts. We tore through small plate of sliced bread that came out early, but was never replenished. Complimentary (mini) limoncello at the end of the meal was a lovely surprise. We appreciated the ability to make a reservation, but overall, there are better options in the North End.", "label": "family"}
